      *====================================================             00010000
       IDENTIFICATION                           DIVISION.               00020000
      *====================================================             00030000
       PROGRAM-ID. FR01CB12.                                            00040000
                                                                        00041000
      *====================================================             00042000
      *  AUTOR: RAFAEL                                                  00043000
      * EMPRESA: FOURSYS                                                00044000
      *----------------------------------------------------             00045007
      *                                                                 00045107
      * OBJETIVO: PRATICANDO DIVISAO COM DIVIDE.                        00046007
      *====================================================             00047000
       ENVIRONMENT                              DIVISION.               00048000
      *====================================================             00049000
       CONFIGURATION                            SECTION.                00049101
       SPECIAL-NAMES.                                                   00050002
           DECIMAL-POINT IS COMMA.                                      00051002
      *====================================================             00060000
       DATA                                     DIVISION.               00070000
      *====================================================             00080000
       WORKING-STORAGE                          SECTION.                00090000
       01 WRK-DADOS.                                                    00100000
          05 WRK-N1            PIC 9(02)    VALUE ZEROS.                00110001
          05 WRK-N2            PIC 9(02)    VALUE ZEROS.                00120001
       77 WRK-RES              PIC 9(03)V99 VALUE ZEROS.                00130001
       77 WRK-RES-ED           PIC ZZ9,99.                              00130104
      *====================================================             00130200
       PROCEDURE                                DIVISION.               00130300
      *====================================================             00130400
                                                                        00130505
      *----------------------------------------------------             00130605
       0000-INICIALIZAR                         SECTION.                00130706
      *----------------------------------------------------             00130805
                                                                        00130907
             PERFORM 1000-INICIALIZAR.                                  00131007
             PERFORM 2000-PROCESSAR.                                    00131207
             PERFORM 3000-FINALIZAR.                                    00131307
             STOP RUN.                                                  00131407
                                                                        00131507
       0000-99-FIM.            EXIT.                                    00131607
                                                                        00131705
      *----------------------------------------------------             00131805
       1000-INICIALIZAR                         SECTION.                00131907
      *----------------------------------------------------             00132007
                                                                        00132107
           ACCEPT   WRK-DADOS  FROM SYSIN.                              00132207
                                                                        00132307
       1000-99-FIM.            EXIT.                                    00132407
                                                                        00132507
      *----------------------------------------------------             00132607
       2000-PROCESSAR                           SECTION.                00132707
      *----------------------------------------------------             00132807
                                                                        00132907
           DISPLAY 'WRK-N1.......... ' WRK-N1.                          00133007
           DISPLAY 'WRK-N2...........' WRK-N2.                          00133100
            DIVIDE WRK-N1 BY WRK-N2 GIVING WRK-RES                      00133200
              ON SIZE ERROR                                             00133300
                DISPLAY 'ERRO NA DIVISAO'                               00133400
              NOT SIZE ERROR                                            00133500
               MOVE WRK-RES TO WRK-RES-ED                               00133604
                DISPLAY 'WRK-RES-ED.' WRK-RES-ED                        00133701
            END-DIVIDE.                                                 00133800
                                                                        00133907
       2000-99-FIM.            EXIT.                                    00134007
                                                                        00134107
      *----------------------------------------------------             00134207
       3000-FINALIZAR                           SECTION.                00134307
      *----------------------------------------------------             00134407
                                                                        00134507
             DISPLAY ' FIM DO PROGRAMA '.                               00134607
                                                                        00134707
       3000-99-FIM.            EXIT.                                    00134807
