      *====================================================             00010000
       IDENTIFICATION                           DIVISION.               00020000
      *====================================================             00030000
       PROGRAM-ID. FR01CB06.                                            00040002
                                                                        00041000
      *====================================================             00042000
      *  AUTOR: RAFAEL                                                  00043000
      * EMPRESA: FOURSYS                                                00044000
      * OBJETIVO: APRENDENDO O COMANDO REDEFINES.                       00044107
      *====================================================             00045000
                                                                        00046000
      *====================================================             00047000
       ENVIRONMENT                              DIVISION.               00048000
      *====================================================             00049000
                                                                        00050000
      *====================================================             00060000
       DATA                                     DIVISION.               00070000
      *====================================================             00080000
       WORKING-STORAGE                          SECTION.                00090000
       01 WRK-DADOS.                                                    00100000
          05 WRK-ID         PIC 9(05) VALUE ZEROS.                      00110003
          05 WRK-NOME       PIC X(30) VALUE SPACES.                     00120003
          05 WRK-ENDERECO   PIC X(30) VALUE SPACES.                     00130003
                                                                        00130100
       01 WRK-DADOS-RED1    REDEFINES WRK-DADOS.                        00131006
          05 WRK-ID-RED1    PIC 9(05).                                  00131103
          05 WRK-NOME-RED1  PIC X(30).                                  00131203
                                                                        00131300
       01 WRK-DADOS-RED2    REDEFINES WRK-DADOS.                        00131406
          05 WRK-ID-RED2    PIC 9(05).                                  00131503
                                                                        00132000
      *====================================================             00140000
       PROCEDURE                                DIVISION.               00150000
      *====================================================             00160000
                                                                        00161007
      *----------------------------------------------------             00162007
       0000-PRINCIPAL                           SECTION.                00163007
      *----------------------------------------------------             00164007
                                                                        00165007
           PERFORM 1000-INICIALIZAR.                                    00166007
           PERFORM 2000-PROCESSAR.                                      00167007
           PERFORM 3000-FINALIZAR.                                      00168007
           STOP RUN.                                                    00169007
                                                                        00169107
       0000-99-FIM.             EXIT.                                   00169207
                                                                        00169307
      *----------------------------------------------------             00169407
       1000-INICIALIZAR                         SECTION.                00169507
      *----------------------------------------------------             00169607
                                                                        00169707
           ACCEPT WRK-DADOS     FROM SYSIN.                             00170000
                                                                        00171007
       1000-99-FIM.             EXIT.                                   00172007
                                                                        00173007
      *----------------------------------------------------             00174007
       2000-PROCESSAR                           SECTION.                00175007
      *----------------------------------------------------             00176007
                                                                        00177007
           DISPLAY 'WRK-DADOS.......' WRK-DADOS.                        00180000
           DISPLAY 'WRK-DADOS-RED1..' WRK-DADOS-RED1.                   00181000
           DISPLAY 'WRK-DADOS-RED2..' WRK-DADOS-RED2.                   00182000
           DISPLAY 'WRK-DADOS.......' WRK-ENDERECO.                     00183005
                                                                        00184007
       2000-99-FIM.             EXIT.                                   00185007
                                                                        00186007
      *----------------------------------------------------             00187007
       3000-PROCESSAR                           SECTION.                00188007
      *----------------------------------------------------             00189007
                                                                        00189107
            DISPLAY ' FIM DO PROGRAMA '.                                00189207
                                                                        00189307
       3000-99-FIM.             EXIT.                                   00190007
                                                                        00191007
      *----------------------------------------------------             00200007
       9000-TRATA-ERROS                         SECTION.                00210007
      *----------------------------------------------------             00220007
                                                                        00221007
       9000-99-FIM.             EXIT.                                   00230007
