      *====================================================             00010000
       IDENTIFICATION                           DIVISION.               00020000
      *====================================================             00030000
       PROGRAM-ID. FR01CB23.                                            00040029
                                                                        00041000
      *====================================================             00042000
      *  AUTOR: RAFAEL                                                  00043000
      * EMPRESA: FOURSYS                                                00044000
      *====================================================             00045000
      *                                                                 00045100
      * OBJETIVO: TABUADA UTILIZANDO PERFORM                            00045200
      *                                                                 00045300
      *====================================================             00045400
                                                                        00045500
      *====================================================             00045600
       ENVIRONMENT                              DIVISION.               00045700
      *====================================================             00045800
       CONFIGURATION                            SECTION.                00045900
       SPECIAL-NAMES.                                                   00046000
           DECIMAL-POINT IS COMMA.                                      00046100
                                                                        00046200
      *====================================================             00046300
       DATA                                     DIVISION.               00046400
      *====================================================             00046500
       WORKING-STORAGE                          SECTION.                00046600
                                                                        00046800
       01 WRK-DADOS.                                                    00046900
           05 WRK-VALOR               PIC 9(02) VALUE ZEROES.           00047024
       77 WRK-CONT                    PIC 9(02) VALUE     10.           00049325
       77 WRK-TOTAL                   PIC 9(05) VALUE ZEROES.           00049422
       77 WRK-ACUM                    PIC 9(05) VALUE ZEROES.           00049522
                                                                        00049609
      *----------------------------------------------------             00049710
                                                                        00049810
       77 WRK-ACUM-ED                 PIC ZZ.ZZ9.                       00049914
       77 WRK-TOTAL-ED                PIC ZZ.ZZ9.                       00050014
                                                                        00050110
      *====================================================             00050200
       PROCEDURE                                DIVISION.               00050300
      *====================================================             00050400
                                                                        00050500
      *----------------------------------------------------             00050600
       0000-PRINCIPAL                           SECTION.                00050700
      *----------------------------------------------------             00050800
                                                                        00050900
             PERFORM 1000-INICIALIZAR.                                  00051000
              IF WRK-VALOR NOT NUMERIC                                  00051118
                 DISPLAY ' INSIRA SOMENTE NUMEROS!'                     00051228
              ELSE                                                      00051320
                PERFORM 2000-PROCESSAR WRK-CONT TIMES                   00051420
                 PERFORM 3000-FINALIZAR                                 00051627
              END-IF.                                                   00051727
             STOP RUN.                                                  00051800
                                                                        00051900
       0000-99-FIM.       EXIT.                                         00052000
                                                                        00052100
      *----------------------------------------------------             00052200
       1000-INICIALIZAR                        SECTION.                 00052300
      *----------------------------------------------------             00052400
                                                                        00052500
           ACCEPT WRK-DADOS     FROM SYSIN.                             00052600
                                                                        00052700
       1000-99-FIM.       EXIT.                                         00052800
                                                                        00052900
      *----------------------------------------------------             00053000
       2000-PROCESSAR                          SECTION.                 00053100
      *----------------------------------------------------             00053200
            COMPUTE WRK-TOTAL = WRK-VALOR * WRK-CONT.                   00053300
            MOVE WRK-TOTAL TO WRK-TOTAL-ED.                             00053411
            DISPLAY WRK-VALOR ' X ' WRK-CONT ' = ' WRK-TOTAL-ED.        00053510
             ADD WRK-TOTAL TO WRK-ACUM.                                 00053608
             SUBTRACT 1 FROM WRK-CONT.                                  00053703
       2000-99-FIM.       EXIT.                                         00053800
                                                                        00053900
      *----------------------------------------------------             00054000
       3000-FINALIZAR                          SECTION.                 00054100
      *----------------------------------------------------             00054200
            MOVE WRK-ACUM TO WRK-ACUM-ED.                               00054311
            DISPLAY 'ACUMULADO TOTAL É:' WRK-ACUM-ED.                   00054410
                                                                        00054500
       3000-99-FIM.       EXIT.                                         00054600
                                                                        00054700
      *----------------------------------------------------             00054800
       9000-TRATAR-ERROS                       SECTION.                 00054900
      *----------------------------------------------------             00055017
                                                                        00055117
       9000-99-FIM.       EXIT.                                         00056000
