      *====================================================             00010000
       IDENTIFICATION                           DIVISION.               00020000
      *====================================================             00030000
       PROGRAM-ID. FR01CB09.                                            00040002
                                                                        00041000
      *====================================================             00042000
      *  AUTOR: RAFAEL                                                  00043000
      * EMPRESA: FOURSYS                                                00044000
      *====================================================             00045000
                                                                        00046000
      *====================================================             00047000
       ENVIRONMENT                              DIVISION.               00048000
      *====================================================             00049000
       CONFIGURATION                            SECTION.                00049103
       SPECIAL-NAMES.                                                   00049203
           DECIMAL-POINT IS COMMA.                                      00050003
      *====================================================             00060000
       DATA                                     DIVISION.               00070000
      *====================================================             00080000
       WORKING-STORAGE                          SECTION.                00090000
       01 WRK-DADOS.                                                    00100000
          05 WRK-N1            PIC 9(02)    VALUE ZEROS.                00110004
          05 WRK-N2            PIC 9(02)    VALUE ZEROS.                00120004
       77 WRK-N3               PIC 9(03)V99 VALUE 1.                    00130004
       77 WRK-N3ED             PIC ZZ9,99.                              00130103
      *====================================================             00131000
       PROCEDURE                                DIVISION.               00132000
      *====================================================             00133000
           ACCEPT   WRK-DADOS  FROM SYSIN.                              00133100
           DISPLAY 'WRK-N1.......... ' WRK-N1.                          00133200
           DISPLAY 'WRK-N2...........' WRK-N2.                          00133300
           ADD WRK-N1 WRK-N2 TO WRK-N3.                                 00133400
            MOVE WRK-N3 TO WRK-N3ED.                                    00133503
           DISPLAY 'WRK-N3ED.........' WRK-N3ED.                        00133603
           STOP RUN.                                                    00133700
