      *====================================================             00010002
       IDENTIFICATION                           DIVISION.               00020002
      *====================================================             00030002
       PROGRAM-ID. FR01CB03.                                            00040008
                                                                        00041000
      *====================================================             00050002
      *  AUTOR: RAFAEL                                                  00060000
      * EMPRESA: FOURSYS                                                00061000
      *====================================================             00070002
                                                                        00080000
      *====================================================             00090002
       ENVIRONMENT                              DIVISION.               00100002
      *====================================================             00110002
                                                                        00120000
      *====================================================             00130002
       DATA                                     DIVISION.               00140002
      *====================================================             00150002
       WORKING-STORAGE                          SECTION.                00150104
                                                                        00150212
       01 WRK-DADOS.                                                    00150308
          05 WRK-CODIGO  PIC X(7)  VALUE SPACES.                        00150408
          05 WRK-NOME    PIC X(23) VALUE SPACES.                        00150508
          05 WRK-AREA    PIC X(10) VALUE SPACES.                        00151108
          05 WRK-ESTADO  PIC X(2)  VALUE SPACES.                        00152008
          05 WRK-SALARIO PIC 9(5)  VALUE ZEROES.                        00153010
                                                                        00154012
      *====================================================             00160002
       PROCEDURE                                DIVISION.               00170002
      *====================================================             00180002
                                                                        00180112
      *----------------------------------------------------             00180212
       0000-PRINCIPAL                           SECTION.                00180312
      *----------------------------------------------------             00180412
                                                                        00180512
           PERFORM 1000-INICIALIZAR.                                    00180612
           PERFORM 2000-PROCESSAR.                                      00180712
           PERFORM 3000-FINALIZAR.                                      00180812
           STOP RUN.                                                    00180912
                                                                        00181012
       0000-99-FIM.           EXIT.                                     00181112
                                                                        00181212
      *----------------------------------------------------             00181312
       1000-INICIALIZAR                         SECTION.                00181412
      *----------------------------------------------------             00181512
                                                                        00181612
           ACCEPT  WRK-DADOS  FROM SYSIN.                               00182009
                                                                        00182112
       1000-99-FIM.           EXIT.                                     00182212
                                                                        00182312
      *----------------------------------------------------             00182412
       2000-PROCESSAR                           SECTION.                00182512
      *----------------------------------------------------             00182612
                                                                        00182712
           DISPLAY 'CODIGO ...'  WRK-CODIGO.                            00183008
           DISPLAY 'NOME .....'  WRK-NOME.                              00190011
           DISPLAY 'AREA .....'  WRK-AREA.                              00190109
           DISPLAY 'ESTADO....'  WRK-ESTADO.                            00190209
           DISPLAY 'SALARIO...'  WRK-SALARIO.                           00191008
                                                                        00191112
       2000-99-FIM.           EXIT.                                     00192012
                                                                        00193012
      *----------------------------------------------------             00194012
       3000-FINALIZAR                           SECTION.                00195012
      *----------------------------------------------------             00196012
                                                                        00197012
            DISPLAY ' FIM DO PROGRAMA '.                                00198012
                                                                        00198112
       3000-99-FIM.           EXIT.                                     00199012
                                                                        00200012
      *----------------------------------------------------             00210012
       9000-TRATA-ERROS                         SECTION.                00220012
      *----------------------------------------------------             00230012
                                                                        00231012
       9000-99-FIM.           EXIT.                                     00240012
