      *====================================================             00010000
       IDENTIFICATION                           DIVISION.               00020000
      *====================================================             00030000
       PROGRAM-ID. FR01CB24.                                            00040000
                                                                        00041000
      *====================================================             00042000
      *  AUTOR: RAFAEL                                                  00043000
      * EMPRESA: FOURSYS                                                00044000
      *====================================================             00045000
      *                                                                 00045100
      * OBJETIVO: CALCULAR JUROS COMPOSTOS                              00045238
      *            COM BASE NOS MESES.                                  00045338
      *                                                                 00045437
      *====================================================             00045500
                                                                        00045600
      *====================================================             00045700
       ENVIRONMENT                              DIVISION.               00045800
      *====================================================             00045900
       CONFIGURATION                            SECTION.                00046000
       SPECIAL-NAMES.                                                   00046100
           DECIMAL-POINT IS COMMA.                                      00046200
                                                                        00046300
      *====================================================             00046400
       DATA                                     DIVISION.               00046500
      *====================================================             00046600
       WORKING-STORAGE                          SECTION.                00046700
                                                                        00046800
                                                                        00046900
       01 WRK-DADOS.                                                    00047000
           05 WRK-AGENCIA             PIC 9(04)    VALUE ZEROES.        00047100
           05 WRK-CONTA               PIC 9(05)    VALUE ZEROES.        00047201
           05 WRK-VALOR               PIC 9(05)V99 VALUE ZEROES.        00047300
           05 WRK-MESES               PIC 9(02)    VALUE ZEROES.        00047400
       77 WRK-VALORTOT                PIC 9(05)V99 VALUE ZEROES.        00047535
                                                                        00047600
       77 WRK-CONT                    PIC 9(02)    VALUE 0.             00047733
                                                                        00048200
      *------------------MASCARAS--------------------------             00049000
                                                                        00049100
       77 WRK-VALOR-ED                PIC ZZ.ZZ9,99.                    00049200
       77 WRK-VALORTOT-ED             PIC ZZ.ZZ9,99.                    00049335
                                                                        00049700
      *====================================================             00049800
       PROCEDURE                                DIVISION.               00049900
      *====================================================             00050000
                                                                        00050100
      *----------------------------------------------------             00050200
       0000-PRINCIPAL                           SECTION.                00050300
      *----------------------------------------------------             00050400
                                                                        00050500
             PERFORM 1000-INICIALIZAR.                                  00050600
             IF WRK-CONTA NOT EQUAL ZEROS                               00050700
               PERFORM 2000-PROCESSAR                                   00050811
             END-IF.                                                    00050900
             PERFORM 3000-FINALIZAR.                                    00051000
             STOP RUN.                                                  00051100
                                                                        00051200
       0000-99-FIM.       EXIT.                                         00052000
                                                                        00052100
      *----------------------------------------------------             00052200
       1000-INICIALIZAR                        SECTION.                 00052300
      *----------------------------------------------------             00052400
                                                                        00052500
           ACCEPT WRK-DADOS     FROM SYSIN.                             00052600
                                                                        00052743
       1000-99-FIM.       EXIT.                                         00052800
                                                                        00052900
      *----------------------------------------------------             00053000
       2000-PROCESSAR                          SECTION.                 00053100
      *----------------------------------------------------             00053200
           MOVE WRK-VALOR TO WRK-VALORTOT.                              00053335
           PERFORM 2100-CALCULO UNTIL WRK-CONT EQUAL WRK-MESES.         00053437
                ACCEPT WRK-DADOS FROM SYSIN.                            00053911
                                                                        00054108
       2000-99-FIM.       EXIT.                                         00054209
                                                                        00054308
      *----------------------------------------------------             00054421
       2100-CALCULO                            SECTION.                 00054518
      *----------------------------------------------------             00054621
                                                                        00054721
            COMPUTE WRK-VALORTOT = WRK-VALORTOT * 1,05.                 00054840
            ADD 1 TO WRK-CONT.                                          00055017
                                                                        00055136
       2100-99-FIM.       EXIT.                                         00055217
                                                                        00055812
                                                                        00055912
      *----------------------------------------------------             00056000
       3000-FINALIZAR                          SECTION.                 00056100
      *----------------------------------------------------             00056200
                                                                        00056304
             DISPLAY ' AGENCIA .......' WRK-AGENCIA.                    00056404
             DISPLAY ' CONTA .........' WRK-CONTA.                      00056504
              MOVE WRK-VALOR TO WRK-VALOR-ED.                           00056631
             DISPLAY ' VALOR .........' WRK-VALOR-ED.                   00056729
             DISPLAY ' MESES..........' WRK-MESES.                      00056804
              MOVE WRK-VALORTOT TO WRK-VALORTOT-ED.                     00056935
             DISPLAY 'VALOR CORRIGIDO ' WRK-VALORTOT-ED.                00057035
       3000-99-FIM.       EXIT.                                         00057100
                                                                        00057200
      *----------------------------------------------------             00057300
       9000-TRATAR-ERROS                       SECTION.                 00057400
      *----------------------------------------------------             00057500
                                                                        00057600
      * DISPLAY ' ERRO NOS VALORES. '.                                  00057705
                                                                        00057800
       9000-99-FIM.       EXIT.                                         00058000
