      *====================================================             00010000
       IDENTIFICATION                           DIVISION.               00020000
      *====================================================             00030000
       PROGRAM-ID. FR01CB15.                                            00040000
                                                                        00041000
      *====================================================             00042000
      *  AUTOR: RAFAEL                                                  00043000
      * EMPRESA: FOURSYS                                                00044000
      *====================================================             00045000
      *                                                                 00045100
      * UTILIZANDO COMANDO COMPUTE PARA CALCULAR MEDIA                  00045200
      *                                                                 00045300
      *====================================================             00045400
                                                                        00046000
      *====================================================             00047000
       ENVIRONMENT                              DIVISION.               00048000
      *====================================================             00049000
       CONFIGURATION                            SECTION.                00049100
       SPECIAL-NAMES.                                                   00049200
           DECIMAL-POINT IS COMMA.                                      00049300
                                                                        00049400
      *====================================================             00049500
       DATA                                     DIVISION.               00049600
      *====================================================             00049700
       WORKING-STORAGE                          SECTION.                00049800
       01 WRK-DADOS.                                                    00049900
          05 WRK-NOTA1         PIC 9(02)V9 VALUE ZEROS.                 00050004
          05 WRK-NOTA2         PIC 9(02)V9 VALUE ZEROS.                 00060004
       77 WRK-MEDIA            PIC 9(03)V99 COMP VALUE ZEROS.           00070003
       77 WRK-MEDIA-ED         PIC Z9,0.                                00080004
       77 WRK-NOTA1-ED         PIC Z9,0.                                00081004
       77 WRK-NOTA2-ED         PIC Z9,0.                                00082004
      *====================================================             00090000
       PROCEDURE                                DIVISION.               00100000
      *====================================================             00110000
                                                                        00111005
      *----------------------------------------------------             00112005
       0000-PRINCIPAL                           SECTION.                00113005
      *----------------------------------------------------             00114005
                                                                        00115005
             PERFORM 1000-INICIALIZAR.                                  00115105
             PERFORM 2000-PROCESSAR.                                    00115205
             PERFORM 3000-FINALIZAR.                                    00115305
             STOP RUN.                                                  00115405
                                                                        00115505
       0000-99-FINAL.          EXIT.                                    00115606
                                                                        00115706
      *----------------------------------------------------             00116005
       1000-INICIALIZAR                         SECTION.                00117005
      *----------------------------------------------------             00118005
                                                                        00119005
           ACCEPT   WRK-DADOS  FROM SYSIN.                              00120000
                                                                        00120105
       1000-99-FINAL.          EXIT.                                    00120206
                                                                        00120306
      *----------------------------------------------------             00120405
       2000-PROCESSAR                           SECTION.                00120505
      *----------------------------------------------------             00120605
                                                                        00120705
            MOVE WRK-NOTA1 TO WRK-NOTA1-ED.                             00121004
              DISPLAY 'WRK-NOTA1....... ' WRK-NOTA1-ED.                 00130004
            MOVE WRK-NOTA2 TO WRK-NOTA2-ED.                             00130104
              DISPLAY 'WRK-NOTA2........' WRK-NOTA2-ED.                 00131004
            COMPUTE WRK-MEDIA = ( WRK-NOTA1 + WRK-NOTA2 ) / 2.          00132002
            MOVE WRK-MEDIA TO WRK-MEDIA-ED.                             00133000
           DISPLAY 'WRK-MEDIA........' WRK-MEDIA-ED.                    00133100
                                                                        00133205
       2000-99-FINAL.          EXIT.                                    00133306
                                                                        00133406
      *----------------------------------------------------             00133505
       3000-FINALIZAR                           SECTION.                00133605
      *----------------------------------------------------             00133705
                                                                        00133805
             DISPLAY ' FIM DO PROGRAMA '.                               00133905
                                                                        00134006
       3000-99-FINAL.          EXIT.                                    00135006
