      *====================================================             00010000
       IDENTIFICATION                           DIVISION.               00020000
      *====================================================             00030000
       PROGRAM-ID. FR01CB07.                                            00040000
                                                                        00041000
      *====================================================             00042000
      *  AUTOR: RAFAEL                                                  00043000
      * EMPRESA: FOURSYS                                                00044000
      * OBJETIVO:UTILIZANDO  REDEFINES E FILLER                         00044126
      *====================================================             00045000
                                                                        00046000
      *====================================================             00047000
       ENVIRONMENT                              DIVISION.               00048000
      *====================================================             00049000
                                                                        00050000
      *====================================================             00060000
       DATA                                     DIVISION.               00070000
      *====================================================             00080000
       WORKING-STORAGE                          SECTION.                00090000
       01 WRK-DADOS.                                                    00100000
          05 WRK-ID            PIC 9(05) VALUE ZEROS.                   00110001
          05 WRK-NOME          PIC X(19) VALUE SPACES.                  00120022
          05 WRK-ENDERECO      PIC X(40) VALUE SPACES.                  00121016
                                                                        00131511
       01 WRK-DADOS-RED        REDEFINES WRK-DADOS.                     00131617
          05 WRK-ID-RED        PIC 9(05).                               00131824
          05 WRK-NOME-RED      PIC X(19).                               00132024
          05 WRK-ENDERECO-RED  PIC X(40).                               00132117
                                                                        00132217
       01 WRK-DADOS-RED2       REDEFINES WRK-DADOS.                     00132520
          05 FILLER            PIC X(43).                               00132621
          05 WRK-BAIRRO-RED2   PIC X(10).                               00132720
          05 FILLER            PIC X(11).                               00132822
      *====================================================             00132900
       PROCEDURE                                DIVISION.               00133000
      *====================================================             00133100
                                                                        00133226
      *----------------------------------------------------             00133326
       0000-PRINCIPAL                           SECTION.                00133426
      *----------------------------------------------------             00133526
                                                                        00133626
           PERFORM 1000-INICIALIZAR.                                    00133726
           PERFORM 2000-PROCESSAR.                                      00133826
           PERFORM 3000-FINALIZAR.                                      00133926
           STOP RUN.                                                    00134026
                                                                        00134126
       0000-99-FIM.            EXIT.                                    00134226
                                                                        00134326
      *----------------------------------------------------             00134426
       1000-INICIALIZAR                         SECTION.                00134526
      *----------------------------------------------------             00134626
                                                                        00134726
           ACCEPT   WRK-DADOS  FROM SYSIN.                              00134804
                                                                        00134926
       0000-99-FIM.            EXIT.                                    00135026
                                                                        00135126
      *----------------------------------------------------             00135226
       2000-PROCESSAR                           SECTION.                00135326
      *----------------------------------------------------             00135426
                                                                        00135526
           DISPLAY 'WRK-DADOS....... ' WRK-DADOS.                       00135614
           DISPLAY 'WRK-DADOS-RED....' WRK-ENDERECO-RED.                00135718
           DISPLAY 'WRK-DADOS-RED2...' WRK-BAIRRO-RED2.                 00136020
                                                                        00136126
       2000-99-FIM.            EXIT.                                    00137026
                                                                        00137126
      *----------------------------------------------------             00137226
       3000-FINALIZAR                           SECTION.                00137326
      *----------------------------------------------------             00137426
                                                                        00137526
            DISPLAY ' FIM DO PROGRAMA '.                                00137626
                                                                        00137726
       3000-99-FIM.            EXIT.                                    00139026
      *----------------------------------------------------             00140026
       9000-TRATA-ERROS                         SECTION.                00150026
      *----------------------------------------------------             00160026
                                                                        00170026
       9000-99-FIM.            EXIT.                                    00180026
