      *=============================================================*   00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=============================================================*   00003000
                                                                        00004000
       PROGRAM-ID. FR19DB09.                                            00005000
                                                                        00006000
      *=============================================================*   00007000
      *   AUTOR....:RAFAEL VIANA                                    *   00007100
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00007200
      *   DATA ....:17/06/2022                                      *   00007300
      *-------------------------------------------------------------*   00007400
      *   OBJETIVO:                                                 *   00007500
      *       LEITURA DE UM REGISTRO DA TABELA.                     *   00007600
      *                                                             *   00007700
      *                                                             *   00007800
      *-------------------------------------------------------------*   00007900
      *   BASE DE DADOS:                                            *   00008000
      *   TABELA.DB2..                                              *   00008100
      *    DDNAME              I/O                 INCLUDE/BOOK     *   00008200
      *   IVAN.FUNC             I                  #BKFUNC----      *   00008300
      *-------------------------------------------------------------*   00008400
      *   MODULOS....:                             INCLUDE/BOOK     *   00008500
      *=============================================================*   00008600
                                                                        00008700
      *=============================================================*   00008800
       ENVIRONMENT                               DIVISION.              00008900
      *=============================================================*   00009000
                                                                        00009100
      *=============================================================*   00009200
       CONFIGURATION                               SECTION.             00009300
      *=============================================================*   00009400
       SPECIAL-NAMES.                                                   00009500
           DECIMAL-POINT IS COMMA.                                      00009600
                                                                        00009700
      *=============================================================*   00009800
       DATA                                      DIVISION.              00009900
      *=============================================================*   00010000
      *=============================================================*   00020000
       WORKING-STORAGE                             SECTION.             00021000
      *=============================================================*   00021100
                                                                        00021200
           EXEC SQL                                                     00021300
              INCLUDE #BKFUNC                                           00021400
           END-EXEC.                                                    00021500
                                                                        00021600
           EXEC SQL                                                     00021700
              INCLUDE SQLCA                                             00021800
           END-EXEC.                                                    00021900
                                                                        00022000
       77 WRK-ID              PIC 9(05) VALUE ZEROES.                   00023000
       77 WRK-SQLCODE         PIC -999.                                 00024000
       77 WRK-NULL-EMAIL      PIC S9(4) COMP.                           00025000
                                                                        00026000
      *=============================================================*   00026100
       PROCEDURE DIVISION.                                              00026200
      *=============================================================*   00026300
                                                                        00026400
      *-------------------------------------------------------------*   00026500
       0000-PRINCIPAL                           SECTION.                00026600
      *-------------------------------------------------------------*   00026700
                                                                        00026800
            PERFORM  1000-INICIAR.                                      00026900
              PERFORM 1100-LER-ARQUIVO.                                 00027015
             IF SQLCODE EQUAL 0                                         00027115
                 PERFORM  2000-PROCESSAR                                00027215
             END-IF.                                                    00027415
            PERFORM  3000-FINALIZAR.                                    00027500
            STOP RUN.                                                   00027600
                                                                        00027700
                                                                        00027800
      *-------------------------------------------------------------*   00027900
       1000-INICIAR                             SECTION.                00028000
      *-------------------------------------------------------------*   00028100
                                                                        00028200
            ACCEPT WRK-ID FROM SYSIN.                                   00028300
                                                                        00028500
       1000-99-FIM.              EXIT.                                  00029000
      *-------------------------------------------------------------*   00030000
       1100-LER-ARQUIVO                         SECTION.                00031000
      *-------------------------------------------------------------*   00031100
                                                                        00031200
            MOVE WRK-ID TO DB2-ID.                                      00031300
                                                                        00031400
            EXEC SQL                                                    00031500
            SELECT ID,NOME,SETOR,SALARIO,DATAADM,EMAIL                  00031600
             INTO :DB2-ID,                                              00031700
                  :DB2-NOME,                                            00031800
                  :DB2-SETOR,                                           00031900
                  :DB2-SALARIO,                                         00032000
                  :DB2-DATAADM,                                         00032100
                  :DB2-EMAIL     :WRK-NULL-EMAIL                        00032200
             FROM IVAN.FUNC                                             00032300
              WHERE ID= :DB2-ID                                         00032400
              FETCH FIRST ROW ONLY                                      00032500
            END-EXEC.                                                   00032600
                                                                        00032700
            IF (SQLCODE  NOT EQUAL ZEROS AND 100) OR                    00032802
               (SQLWARN0 EQUAL 'W' )                                    00032902
               MOVE SQLCODE TO WRK-SQLCODE                              00033000
               DISPLAY 'ERRO NA LEITURA ' WRK-SQLCODE                   00033100
            END-IF.                                                     00033400
                                                                        00033500
            IF SQLCODE EQUAL 100                                        00033607
              DISPLAY 'NAO ENCONTRADO ' DB2-ID                          00033700
            END-IF.                                                     00034000
                                                                        00035000
                                                                        00035400
                                                                        00035500
       1100-99-FIM.              EXIT.                                  00035600
                                                                        00035700
      *-------------------------------------------------------------*   00035800
       2000-PROCESSAR                           SECTION.                00035900
      *-------------------------------------------------------------*   00036000
                                                                        00036100
              DISPLAY 'ID......' DB2-ID.                                00036316
              DISPLAY 'NOME....' DB2-NOME.                              00036416
              DISPLAY 'SETOR...' DB2-SETOR.                             00036516
              DISPLAY 'SALARIO.' DB2-SALARIO.                           00036616
              DISPLAY 'DATAADM.' DB2-DATAADM.                           00036716
               IF WRK-NULL-EMAIL = 0                                    00036800
                 DISPLAY 'EMAIL. ' DB2-EMAIL                            00036900
               ELSE                                                     00037000
                 DISPLAY 'EMAIL NULO'                                   00037100
               END-IF.                                                  00037216
                                                                        00037400
       2000-99-FIM.              EXIT.                                  00037500
      *-------------------------------------------------------------*   00037600
       3000-FINALIZAR                           SECTION.                00037700
      *-------------------------------------------------------------*   00037800
                                                                        00037900
              DISPLAY ' -----FIM DO PROGRAMA----- '.                    00038000
                                                                        00039000
       3000-99-FIM.              EXIT.                                  00040000
      *-------------------------------------------------------------*   00041000
       9000-TRATAERROS                              SECTION.            00042000
      *-------------------------------------------------------------*   00043000
                                                                        00044000
       9000-99-FIM.              EXIT.                                  00045000
