      *====================================================             00010013
       IDENTIFICATION                           DIVISION.               00020013
      *====================================================             00030013
       PROGRAM-ID. FR01CB23.                                            00040013
                                                                        00041013
      *====================================================             00042013
      *  AUTOR: RAFAEL                                                  00043013
      * EMPRESA: FOURSYS                                                00044013
      *====================================================             00045013
      *                                                                 00045113
      * OBJETIVO: TABUADA UTILIZANDO PERFORM                            00045213
      *                                                                 00045313
      *====================================================             00045413
                                                                        00045513
      *====================================================             00045613
       ENVIRONMENT                              DIVISION.               00045713
      *====================================================             00045813
       CONFIGURATION                            SECTION.                00045913
       SPECIAL-NAMES.                                                   00046013
           DECIMAL-POINT IS COMMA.                                      00046113
                                                                        00046213
      *====================================================             00046313
       DATA                                     DIVISION.               00046413
      *====================================================             00046513
       WORKING-STORAGE                          SECTION.                00046613
                                                                        00046713
       01 WRK-DADOS.                                                    00046813
           05 WRK-VALOR               PIC 9(02) VALUE ZEROES.           00046913
       77 WRK-CONT                    PIC 9(02) VALUE      1.           00047025
       77 WRK-CONT-TIME               PIC 9(02) VALUE     10.           00047125
       77 WRK-TOTAL                   PIC 9(05) VALUE ZEROES.           00048013
       77 WRK-ACUM                    PIC 9(05) VALUE ZEROES.           00049013
                                                                        00049113
      *----------------------------------------------------             00049213
                                                                        00049313
       77 WRK-ACUM-ED                 PIC ZZ.ZZ9.                       00049413
       77 WRK-TOTAL-ED                PIC ZZ.ZZ9.                       00049513
                                                                        00049613
      *====================================================             00049713
       PROCEDURE                                DIVISION.               00049813
      *====================================================             00049913
                                                                        00050013
      *----------------------------------------------------             00050113
       0000-PRINCIPAL                           SECTION.                00050213
      *----------------------------------------------------             00050313
                                                                        00050413
             PERFORM 1000-INICIALIZAR.                                  00050513
              IF WRK-VALOR NOT NUMERIC                                  00050613
               PERFORM 9000-TRATAR-ERROS                                00050723
              ELSE                                                      00050831
                PERFORM 2000-PROCESSAR UNTIL WRK-VALOR EQUAL 99         00051029
                 PERFORM 3000-FINALIZAR                                 00051429
               END-IF.                                                  00051529
             STOP RUN.                                                  00051613
                                                                        00051713
       0000-99-FIM.       EXIT.                                         00051813
                                                                        00051913
      *----------------------------------------------------             00052013
       1000-INICIALIZAR                        SECTION.                 00052113
      *----------------------------------------------------             00052213
                                                                        00052313
           ACCEPT WRK-DADOS     FROM SYSIN.                             00052413
                                                                        00052513
       1000-99-FIM.       EXIT.                                         00052613
                                                                        00052713
      *----------------------------------------------------             00052813
       2000-PROCESSAR                          SECTION.                 00052913
      *----------------------------------------------------             00053013
                                                                        00053122
             DISPLAY ' ---- TABUADA DO ' WRK-VALOR '----'.              00053226
              PERFORM 2100-VEZES WRK-CONT-TIME TIMES.                   00053325
             DISPLAY '----------------------------------'.              00053426
               MOVE 1 TO WRK-CONT.                                      00053822
                ACCEPT WRK-DADOS     FROM SYSIN.                        00053922
       2000-99-FIM.       EXIT.                                         00054013
                                                                        00054113
                                                                        00054213
      *----------------------------------------------------             00054313
       2100-VEZES                              SECTION.                 00054413
      *----------------------------------------------------             00054513
                                                                        00054613
            COMPUTE WRK-TOTAL = WRK-VALOR * WRK-CONT.                   00054722
             MOVE WRK-TOTAL TO WRK-TOTAL-ED.                            00054926
              DISPLAY WRK-VALOR ' X ' WRK-CONT ' = ' WRK-TOTAL-ED.      00055026
             ADD WRK-TOTAL TO WRK-ACUM.                                 00055122
              ADD 1 TO WRK-CONT.                                        00055226
       2100-99-FIM.       EXIT.                                         00055614
                                                                        00055714
      *----------------------------------------------------             00055813
       3000-FINALIZAR                          SECTION.                 00055913
      *----------------------------------------------------             00056013
            MOVE WRK-ACUM TO WRK-ACUM-ED.                               00056113
            DISPLAY ' ACUMULADO TOTAL :' WRK-ACUM-ED.                   00056216
                                                                        00056313
       3000-99-FIM.       EXIT.                                         00056413
                                                                        00056513
      *----------------------------------------------------             00056613
       9000-TRATAR-ERROS                       SECTION.                 00056713
      *----------------------------------------------------             00056813
                                                                        00056913
                 DISPLAY ' INSIRA SOMENTE NUMEROS!'.                    00057022
                                                                        00057122
       9000-99-FIM.       EXIT.                                         00058013
