      *====================================================             00010000
       IDENTIFICATION                           DIVISION.               00020000
      *====================================================             00030000
       PROGRAM-ID. FR01CB08.                                            00040006
                                                                        00041000
      *====================================================             00042000
      *  AUTOR: RAFAEL                                                  00043000
      * EMPRESA: FOURSYS                                                00044000
      *====================================================             00045000
                                                                        00046000
      *====================================================             00047000
       ENVIRONMENT                              DIVISION.               00048000
      *====================================================             00049000
       CONFIGURATION                            SECTION.                00049107
       SPECIAL-NAMES.                                                   00049207
           DECIMAL-POINT IS COMMA.                                      00049307
                                                                        00050000
      *====================================================             00060000
       DATA                                     DIVISION.               00070000
      *====================================================             00080000
       WORKING-STORAGE                          SECTION.                00090000
       01 WRK-DADOS.                                                    00100000
          05 WRK-N1            PIC 9(02)    VALUE ZEROS.                00110007
          05 WRK-N2            PIC 9(02)    VALUE ZEROS.                00130107
       77 WRK-N3               PIC 9(03)V99 VALUE ZEROS.                00131007
       77 WRK-N3ED             PIC ZZ9,00.                              00131107
      *====================================================             00132000
       PROCEDURE                                DIVISION.               00133000
      *====================================================             00133100
           ACCEPT   WRK-DADOS  FROM SYSIN.                              00133200
           DISPLAY 'WRK-N1.......... ' WRK-N1.                          00133301
           DISPLAY 'WRK-N2...........' WRK-N2.                          00133401
           ADD WRK-N1 WRK-N2 TO WRK-N3.                                 00133504
            MOVE WRK-N3 TO WRK-N3ED.                                    00133607
           DISPLAY 'WRK-N3ED.........' WRK-N3ED.                        00133707
           STOP RUN.                                                    00133800
