      *====================================================             00010000
       IDENTIFICATION                           DIVISION.               00020000
      *====================================================             00030000
       PROGRAM-ID. FR01CB11.                                            00040002
                                                                        00041000
      *====================================================             00042000
      *  AUTOR: RAFAEL                                                  00043000
      * EMPRESA: FOURSYS                                                00044000
      * OBJETIVO:INSERIR DADOS E CALCULAR DESCONTO.                     00045016
      *                                                                 00046016
      *====================================================             00047000
       ENVIRONMENT                              DIVISION.               00048000
      *====================================================             00049000
       CONFIGURATION                            SECTION.                00049114
       SPECIAL-NAMES.                                                   00050014
           DECIMAL-POINT IS COMMA.                                      00051014
      *====================================================             00060000
       DATA                                     DIVISION.               00070000
      *====================================================             00080000
       WORKING-STORAGE                          SECTION.                00090000
       01 WRK-DADOS.                                                    00100000
          05 WRK-TV            PIC  X(30) VALUE SPACES.                 00110006
          05 WRK-VALPROD       PIC 9(05) VALUE ZEROS.                   00120013
          05 WRK-DESC          PIC 9(03) VALUE ZEROS.                   00130013
       77 WRK-RES              PIC 9(06) VALUE ZEROS.                   00130115
       77 WRK-RES-EDIT         PIC -Z.ZZ9,99.                           00130215
      *====================================================             00130300
       PROCEDURE                                DIVISION.               00130400
      *====================================================             00130500
                                                                        00130616
      *----------------------------------------------------             00130716
       0000-PRINCIPAL                           SECTION.                00130816
      *----------------------------------------------------             00130916
                                                                        00131016
            PERFORM 1000-INICIALIZAR.                                   00131116
            PERFORM 2000-PROCESSAR.                                     00131216
            PERFORM 3000-FINALIZAR.                                     00131316
            STOP RUN.                                                   00131416
                                                                        00131516
       0000-99-FIM.            EXIT.                                    00131616
                                                                        00131716
      *----------------------------------------------------             00131816
       1000-INICIALIZAR                         SECTION.                00131916
      *----------------------------------------------------             00132016
                                                                        00132116
           ACCEPT   WRK-DADOS  FROM SYSIN.                              00132200
                                                                        00132316
       1000-99-FIM.            EXIT.                                    00132416
                                                                        00132516
      *----------------------------------------------------             00132616
       2000-PROCESSAR                           SECTION.                00132716
      *----------------------------------------------------             00132816
                                                                        00132916
           DISPLAY 'WRK-TV.......... ' WRK-TV.                          00133002
           DISPLAY 'WRK-VALPROD......' WRK-VALPROD.                     00133102
           DISPLAY 'WRK-DESC........ ' WRK-DESC.                        00133202
            SUBTRACT WRK-DESC FROM WRK-VALPROD GIVING WRK-RES.          00133302
           MOVE WRK-RES TO WRK-RES-EDIT.                                00133409
           DISPLAY 'WRK-RES-EDIT.... ' WRK-RES-EDIT.                    00133503
                                                                        00133616
      *----------------------------------------------------             00133716
       3000-FINALIZAR                           SECTION.                00133816
      *----------------------------------------------------             00133916
                                                                        00134016
               DISPLAY ' FIM DO PROGRAMA ' .                            00134116
                                                                        00134216
       3000-99-FIM.            EXIT.                                    00134316
                                                                        00134416
      *----------------------------------------------------             00134516
       9000-TRATA-ERROS                         SECTION.                00134616
      *----------------------------------------------------             00134716
                                                                        00134816
                                                                        00134916
       9000-99-FIM.            EXIT.                                    00135016
