      *=============================================================*   00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=============================================================*   00003000
                                                                        00004000
       PROGRAM-ID. RELBENE.                                             00005000
                                                                        00006000
      *=============================================================*   00007000
      *   AUTOR....:RAFAEL VIANA                                    *   00008001
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00009001
      *   DATA ....:14/06/2022                                      *   00010001
      *-------------------------------------------------------------*   00010101
      *   OBJETIVO:LER ARQUIVO (SRELBENE) E CRIAR UM RELATORIO      *   00010201
      *          COM QUEBRA DE PAGINAS.                             *   00010325
      *                                                             *   00010401
      *                                                             *   00010501
      *-------------------------------------------------------------*   00010601
      *   ARQUIVOS...:                                              *   00010702
      *    DDNAME              I/O                 INCLUDE/BOOK     *   00010802
      *    SRELBENE             I                  -----------      *   00010902
      *    RELABENE             O                  -----------      *   00011025
      *-------------------------------------------------------------*   00011201
      *   MODULOS....:                             INCLUDE/BOOK     *   00011301
      *=============================================================*   00011401
                                                                        00011500
      *=============================================================*   00011600
       ENVIRONMENT                               DIVISION.              00011700
      *=============================================================*   00011800
                                                                        00011900
      *=============================================================*   00012000
       CONFIGURATION                               SECTION.             00012100
      *=============================================================*   00012200
       SPECIAL-NAMES.                                                   00012300
           DECIMAL-POINT IS COMMA.                                      00013000
                                                                        00014000
                                                                        00015000
       INPUT-OUTPUT                                SECTION.             00015100
       FILE-CONTROL.                                                    00015200
           SELECT SRELBENE ASSIGN TO SRELBENE                           00015302
               FILE STATUS  IS WRK-FS-SRELBENE.                         00015402
                                                                        00015535
      *---------------ARQUIVO OUTPUT--------------------------------*   00015635
                                                                        00015735
           SELECT RELABENE ASSIGN TO RELABENE                           00015817
               FILE STATUS  IS WRK-FS-RELABENE.                         00015917
                                                                        00016017
      *=============================================================*   00016100
       DATA                                      DIVISION.              00016200
      *=============================================================*   00016300
       FILE                                      SECTION.               00016400
       FD SRELBENE                                                      00016502
           RECORDING  MODE IS F                                         00016600
           BLOCK CONTAINS 0 RECORDS.                                    00016700
                                                                        00016800
                                                                        00016900
      *---------LRECL-68--------------------------------------------*   00017002
       01 FD-SRELBENE.                                                  00017102
          05 FD-ID          PIC 9(05).                                  00017203
          05 FD-NOME        PIC X(30).                                  00017300
          05 FD-SALARIO     PIC 9(10).                                  00017403
          05 FD-PLANMED     PIC X(10).                                  00017503
          05 FD-PLANDENT    PIC X(10).                                  00017603
          05 FD-COTAS       PIC 9(03).                                  00017703
                                                                        00017803
      *--------LRECL 90---------------------------------------------*   00017917
       FD RELABENE                                                      00018017
           RECORDING  MODE IS F                                         00018117
           BLOCK CONTAINS 0 RECORDS.                                    00018217
                                                                        00018317
       01 FD-RELABENE       PIC X(90).                                  00018417
                                                                        00018517
      *=============================================================*   00018603
       WORKING-STORAGE                             SECTION.             00018703
      *=============================================================*   00018803
      *----------------LRECL 89-------------------------------------*   00018908
       01 FILLER             PIC X(70) VALUE                            00019017
                  '--------------VARIAVEIS RECEBIDAS-SRELBENE---'.      00019117
      *-------------------------------------------------------------*   00019225
                                                                        00019325
       01 WRK-SRELBENE2.                                                00019403
          05 WRK-ID          PIC 9(05).                                 00019503
          05 FILLER          PIC X(04).                                 00019603
          05 WRK-NOME        PIC X(30).                                 00019703
          05 FILLER          PIC X(01).                                 00019808
          05 WRK-SALARIO     PIC 9(10).                                 00019903
          05 FILLER          PIC X(04).                                 00020003
          05 WRK-PLANMED     PIC X(10).                                 00021003
          05 FILLER          PIC X(04).                                 00021103
          05 WRK-PLANDENT    PIC X(10).                                 00021307
          05 FILLER          PIC X(04).                                 00021403
          05 WRK-COTAS       PIC 9(03).                                 00021503
          05 FILLER          PIC X(04).                                 00021603
      *-------------------------------------------------------------*   00021717
       01 FILLER             PIC X(70) VALUE                            00021817
                  '--------------CABECALHO 1 E 2 TAMANHO 89---------'.  00021918
      *-------------------------------------------------------------*   00022025
                                                                        00022117
       01 WRK-CABEC.                                                    00022200
          05 WRK-CABEC1.                                                00022300
            10 FILLER   PIC X(13).                                      00022408
            10 FILLER   PIC X(37) VALUE                                 00022500
               'RELATORIO DE FUNCIONARIOS       PAG: '.                 00022600
            10 WRK-PAG  PIC 9(02) VALUE 1.                              00023000
            10 FILLER   PIC X(37).                                      00023104
                                                                        00023217
                                                                        00023517
          05 WRK-CABEC2.                                                00023600
            10 FILLER   PIC X(09) VALUE 'ID       '.                    00023700
            10 FILLER   PIC X(04) VALUE 'NOME'.                         00023800
            10 FILLER   PIC X(27).                                      00023908
            10 FILLER   PIC X(14) VALUE 'SALARIO      '.                00024004
            10 FILLER   PIC X(14) VALUE 'PLANO MEDICO '.                00024104
            10 FILLER   PIC X(14) VALUE 'PLANO DENTAL '.                00024204
            10 FILLER   PIC X(07) VALUE 'COTAS  '.                      00024304
                                                                        00024404
      *-------------------------------------------------------------*   00024525
       01 FILLER             PIC X(70) VALUE                            00024617
                  '--------------ESPACO EM BRANCO---------------'.      00024717
      *-------------------------------------------------------------*   00024825
                                                                        00024904
       01 WRK-ESPACO      PIC X(01) VALUE SPACES.                       00025004
                                                                        00025104
                                                                        00025204
      *-------------------------------------------------------------*   00025325
       01 FILLER             PIC X(70) VALUE                            00025417
                  '--------------VARIAVEIS DE STATUS------------'.      00025517
      *-------------------------------------------------------------*   00025625
                                                                        00025717
       77 WRK-FS-SRELBENE PIC 9(02).                                    00025804
       77 WRK-FS-RELABENE PIC 9(02).                                    00025917
                                                                        00026017
                                                                        00026117
      *-------------------------------------------------------------*   00026225
       01 FILLER             PIC X(70) VALUE                            00026317
                  '--------------VARIAVEIS ACUMULADAS-----------'.      00026417
      *-------------------------------------------------------------*   00026525
                                                                        00026617
       77 WRK-ACUM-LIDOS  PIC 9(03).                                    00026717
       77 WRK-ACUM-SAL    PIC 9(08)V99.                                 00026817
                                                                        00026917
                                                                        00027017
      *-------------------------------------------------------------*   00027125
       01 FILLER             PIC X(70) VALUE                            00027217
                  '--------------VARIAVEL CONTAR LINHAS---------'.      00027317
      *-------------------------------------------------------------*   00027425
                                                                        00027517
                                                                        00027617
       77 WRK-LINHA       PIC 9(02) VALUE 1.                            00027717
                                                                        00027817
      *-------------------------------------------------------------*   00027925
       01 FILLER             PIC X(70) VALUE                            00028017
                  '---------------------- MASCARA---------------'.      00028117
      *-------------------------------------------------------------*   00028225
                                                                        00028317
                                                                        00028417
       77 WRK-ACUM-SAL-ED  PIC Z.ZZZ.ZZ9,99.                            00028517
                                                                        00028617
                                                                        00028717
      *-------------------------------------------------------------*   00028825
       01 FILLER             PIC X(70) VALUE                            00028917
                  '---------------------- MENSAGENS-------------'.      00029023
      *-------------------------------------------------------------*   00029125
                                                                        00029217
       77 WRK-FINARQ         PIC X(16) VALUE                            00029317
                                       'FINAL DE ARQUIVO'.              00029417
       77 WRK-MSGREGLIDOS    PIC X(25) VALUE                            00029517
                                       'REGISTROS LIDOS.........:'.     00029617
       77 WRK-MSGSALACUM     PIC X(25) VALUE                            00029717
                                       'SALARIO TOTAL ACUMULADO.:'.     00029817
       77 WRK-MSGFINALREL    PIC X(50) VALUE                            00029923
                        '---------------FINAL DO RELATORIO------------'.00030024
                                                                        00030125
      *=============================================================*   00030217
       PROCEDURE DIVISION.                                              00030317
      *=============================================================*   00030417
                                                                        00030517
      *-------------------------------------------------------------*   00030617
       0000-PRINCIPAL                         SECTION.                  00030717
      *-------------------------------------------------------------*   00030817
            PERFORM 1000-INICIAR.                                       00030917
            PERFORM 2000-PROCESSAR UNTIL WRK-FS-SRELBENE EQUAL 10.      00031017
            PERFORM 3000-FINALIZAR.                                     00031117
            STOP RUN.                                                   00031217
                                                                        00031317
                                                                        00031417
                                                                        00031517
      *-------------------------------------------------------------*   00031617
       1000-INICIAR                           SECTION.                  00031717
      *-------------------------------------------------------------*   00031817
            OPEN INPUT SRELBENE                                         00031919
                 OUTPUT RELABENE.                                       00032019
              PERFORM 1200-TESTARSTATUS.                                00032117
               READ SRELBENE.                                           00032217
                PERFORM 1100-CABECALHO.                                 00032317
                                                                        00032417
                                                                        00032517
       1000-99-FIM.               EXIT.                                 00032617
                                                                        00032717
      *-------------------------------------------------------------*   00032817
       1100-CABECALHO                         SECTION.                  00032917
      *-------------------------------------------------------------*   00033017
                WRITE FD-RELABENE FROM WRK-ESPACO.                      00033231
                IF WRK-PAG EQUAL 1                                      00033317
                 WRITE FD-RELABENE FROM WRK-CABEC1                      00033417
                ELSE                                                    00033517
                 WRITE FD-RELABENE FROM WRK-CABEC1 AFTER PAGE           00033617
                END-IF.                                                 00033731
                WRITE FD-RELABENE FROM WRK-ESPACO.                      00033831
                WRITE FD-RELABENE FROM WRK-CABEC2.                      00033931
                   ADD 4 TO WRK-LINHA.                                  00034031
                                                                        00034317
       1100-99-FIM.               EXIT.                                 00034417
                                                                        00034517
      *-------------------------------------------------------------*   00034617
       1200-TESTARSTATUS                      SECTION.                  00034717
      *-------------------------------------------------------------*   00034817
               IF WRK-FS-SRELBENE NOT EQUAL 0                           00034917
                   PERFORM 9000-TRATARERROS                             00035017
               END-IF.                                                  00035117
               IF WRK-FS-RELABENE NOT EQUAL 0                           00035219
                   PERFORM 9000-TRATARERROS                             00035319
               END-IF.                                                  00035419
                                                                        00035519
       1100-99-FIM.               EXIT.                                 00035617
                                                                        00035717
      *-------------------------------------------------------------*   00035817
       2000-PROCESSAR                         SECTION.                  00035917
      *-------------------------------------------------------------*   00036017
             ADD 1 TO WRK-ACUM-LIDOS.                                   00036117
             ADD FD-SALARIO TO WRK-ACUM-SAL.                            00036204
               PERFORM 2100-MOVE-VARIAVEL.                              00036300
                READ SRELBENE.                                          00036404
                   IF WRK-LINHA GREATER 05 AND WRK-FS-SRELBENE EQUAL 0  00036534
                    PERFORM 2200-TROCA-PAGINA                           00036631
                   END-IF.                                              00036731
                                                                        00036800
              IF WRK-FS-SRELBENE NOT EQUAL 0                            00036906
                DISPLAY WRK-FINARQ                                      00037017
              END-IF.                                                   00037100
                                                                        00037200
                                                                        00037300
       2000-99-FIM.               EXIT.                                 00037400
                                                                        00037500
      *-------------------------------------------------------------*   00037600
       2100-MOVE-VARIAVEL                     SECTION.                  00037700
      *-------------------------------------------------------------*   00037800
                                                                        00037900
                 MOVE FD-ID       TO WRK-ID.                            00038004
                 MOVE FD-NOME     TO WRK-NOME.                          00038104
                 MOVE FD-SALARIO  TO WRK-SALARIO.                       00038204
                 MOVE FD-PLANMED  TO WRK-PLANMED.                       00038304
                 MOVE FD-PLANDENT TO WRK-PLANDENT.                      00038404
                 MOVE FD-COTAS    TO WRK-COTAS.                         00038504
                WRITE FD-RELABENE FROM WRK-SRELBENE2.                   00038620
                  ADD 1 TO WRK-LINHA.                                   00038713
                                                                        00039504
       2100-99-FIM.               EXIT.                                 00039604
                                                                        00039704
      *-------------------------------------------------------------*   00039804
       2200-TROCA-PAGINA                      SECTION.                  00040000
      *-------------------------------------------------------------*   00040100
                                                                        00040200
                        ADD 1 TO WRK-PAG.                               00040304
                        MOVE 1 TO WRK-LINHA.                            00040900
                         PERFORM 1100-CABECALHO.                        00041000
                                                                        00041100
       2200-99-FIM.               EXIT.                                 00041200
                                                                        00041300
      *-------------------------------------------------------------*   00041400
       3000-FINALIZAR                         SECTION.                  00041500
      *-------------------------------------------------------------*   00041600
               WRITE FD-RELABENE FROM WRK-MSGFINALREL.                  00041723
               WRITE FD-RELABENE FROM WRK-ESPACO.                       00041821
               WRITE FD-RELABENE FROM WRK-MSGREGLIDOS.                  00041922
               WRITE FD-RELABENE FROM WRK-ACUM-LIDOS.                   00042022
                MOVE WRK-ACUM-SAL TO WRK-ACUM-SAL-ED.                   00042123
               WRITE FD-RELABENE FROM WRK-MSGSALACUM.                   00042222
               WRITE FD-RELABENE FROM WRK-ACUM-SAL-ED.                  00042322
               CLOSE SRELBENE RELABENE.                                 00042423
                                                                        00042521
       3000-99-FIM.               EXIT.                                 00042621
                                                                        00042721
      *-------------------------------------------------------------*   00042821
       9000-TRATARERROS                       SECTION.                  00042921
      *-------------------------------------------------------------*   00043021
               STOP RUN.                                                00043109
                                                                        00043200
       9000-99-FIM.               EXIT.                                 00044000
