      *=============================================================*   00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=============================================================*   00003000
                                                                        00004000
       PROGRAM-ID. FR19DB03.                                            00005001
                                                                        00006000
      *=============================================================*   00007000
      *   AUTOR....:RAFAEL VIANA                                    *   00007100
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00007200
      *   DATA ....:08/06/2022                                      *   00007301
      *-------------------------------------------------------------*   00007400
      *   OBJETIVO:                                                 *   00007500
      *       INSERIR DADOS EM UMA TABELA DB2.                      *   00007601
      *                                                             *   00007700
      *                                                             *   00007800
      *-------------------------------------------------------------*   00007900
      *   BASE DE DADOS:                                            *   00008000
      *   TABELA.DB2..                                              *   00008100
      *    DDNAME              I/O                 INCLUDE/BOOK     *   00008200
      *   IVAN.FUNC             I                  #BKFUNC----      *   00008300
      *-------------------------------------------------------------*   00008400
      *   MODULOS....:                             INCLUDE/BOOK     *   00008500
      *=============================================================*   00008600
                                                                        00008700
      *=============================================================*   00008800
       ENVIRONMENT                               DIVISION.              00008900
      *=============================================================*   00009000
                                                                        00009100
      *=============================================================*   00009200
       CONFIGURATION                               SECTION.             00009300
      *=============================================================*   00009400
       SPECIAL-NAMES.                                                   00009500
           DECIMAL-POINT IS COMMA.                                      00009600
                                                                        00009700
      *=============================================================*   00009800
       DATA                                      DIVISION.              00009900
      *=============================================================*   00010000
      *=============================================================*   00020000
       WORKING-STORAGE                             SECTION.             00021000
      *=============================================================*   00021100
                                                                        00021200
           EXEC SQL                                                     00021300
              INCLUDE #BKFUNC                                           00021400
           END-EXEC.                                                    00021500
                                                                        00021600
           EXEC SQL                                                     00021700
              INCLUDE SQLCA                                             00021800
           END-EXEC.                                                    00021900
       01 WRK-ID.                                                       00022001
          05 FILLER              PIC X(10).                             00022101
          05 WRK-ID-AC           PIC 9(05).                             00023001
                                                                        00023101
       01 WRK-NOME.                                                     00023201
          05 FILLER              PIC X(10).                             00023301
          05 WRK-NOME-AC         PIC X(30).                             00023401
                                                                        00023501
       01 WRK-SETOR.                                                    00023601
          05 FILLER              PIC X(10).                             00023701
          05 WRK-SETOR-AC        PIC X(04).                             00023801
                                                                        00023901
       01 WRK-SALARIO.                                                  00024001
          05 FILLER              PIC X(10).                             00024101
          05 WRK-SALARIO-AC      PIC 9(08)V99.                          00024201
                                                                        00024301
       01 WRK-DATAADM.                                                  00024401
          05 FILLER              PIC X(10).                             00024501
          05 WRK-DATAADM-AC      PIC X(10).                             00024601
                                                                        00024701
       01 WRK-EMAIL.                                                    00024801
          05 FILLER              PIC X(10).                             00024901
          05 WRK-EMAIL-AC        PIC X(40).                             00025001
                                                                        00025101
       77 WRK-SQLCODE         PIC -999.                                 00025200
       77 WRK-NULL-EMAIL      PIC S9(4) COMP.                           00025300
                                                                        00026000
      *=============================================================*   00026100
       PROCEDURE DIVISION.                                              00026200
      *=============================================================*   00026300
                                                                        00026400
      *-------------------------------------------------------------*   00026500
       0000-PRINCIPAL                           SECTION.                00026600
      *-------------------------------------------------------------*   00026700
                                                                        00026800
            PERFORM  1000-INICIAR.                                      00026900
            PERFORM  2000-PROCESSAR.                                    00027003
                                                                        00027403
            PERFORM  3000-FINALIZAR.                                    00027500
            STOP RUN.                                                   00027600
                                                                        00027700
                                                                        00027800
      *-------------------------------------------------------------*   00027900
       1000-INICIAR                             SECTION.                00028000
      *-------------------------------------------------------------*   00028100
                                                                        00028200
            ACCEPT WRK-ID.                                              00028301
            ACCEPT WRK-NOME.                                            00028401
            ACCEPT WRK-SETOR.                                           00028501
            ACCEPT WRK-SALARIO.                                         00028601
            ACCEPT WRK-DATAADM.                                         00028701
            ACCEPT WRK-EMAIL.                                           00028801
            PERFORM 1200-TESTAR-ID.                                     00028912
                                                                        00029001
       1000-99-FIM.              EXIT.                                  00029100
                                                                        00029204
      *-------------------------------------------------------------*   00029304
       1200-TESTAR-ID                           SECTION.                00029404
      *-------------------------------------------------------------*   00029504
                                                                        00029604
            IF WRK-ID-AC NOT NUMERIC OR WRK-ID-AC EQUAL 0               00029712
              DISPLAY ' SOMENTO NUMERICOS E MAIOR QUE (0) ' WRK-ID      00030012
              STOP RUN                                                  00030109
            END-IF.                                                     00030204
                                                                        00030306
       1200-99-FIM.              EXIT.                                  00031004
      *-------------------------------------------------------------*   00031100
       2000-PROCESSAR                           SECTION.                00031200
      *-------------------------------------------------------------*   00031300
                                                                        00031400
            MOVE WRK-ID-AC TO DB2-ID.                                   00031601
            MOVE WRK-NOME-AC TO DB2-NOME.                               00031701
            MOVE WRK-SETOR-AC TO DB2-SETOR.                             00031801
            MOVE WRK-SALARIO-AC TO DB2-SALARIO.                         00031901
            MOVE WRK-DATAADM-AC TO DB2-DATAADM.                         00032001
            MOVE WRK-EMAIL-AC TO DB2-EMAIL.                             00032101
                                                                        00032201
            EXEC SQL                                                    00032301
             INSERT INTO                                                00032401
              IVAN.FUNC(ID,NOME,SETOR,SALARIO,DATAADM,EMAIL)            00032501
            VALUES(:DB2-ID,                                             00032601
                   :DB2-NOME,                                           00032701
                   :DB2-SETOR,                                          00032801
                   :DB2-SALARIO,                                        00032901
                   :DB2-DATAADM,                                        00033001
                   :DB2-EMAIL)                                          00033101
            END-EXEC.                                                   00033201
                                                                        00033301
            EVALUATE SQLCODE                                            00033401
             WHEN 0                                                     00033501
              DISPLAY 'DADOS INSERIDOS'                                 00033601
              DISPLAY 'ID......' DB2-ID                                 00033701
              DISPLAY 'NOME....' DB2-NOME                               00033801
              DISPLAY 'SETOR...' DB2-SETOR                              00033901
              DISPLAY 'SALARIO.' DB2-SALARIO                            00034001
              DISPLAY 'DATAADM.' DB2-DATAADM                            00034101
              DISPLAY 'EMAIL. ' DB2-EMAIL                               00034201
             WHEN -181                                                  00034701
              DISPLAY 'DATA FORMATO ERRADO' WRK-DATAADM-AC              00034801
             WHEN OTHER                                                 00034901
               MOVE SQLCODE TO WRK-SQLCODE                              00035001
               DISPLAY 'ERRO NA LEITURA ' WRK-SQLCODE                   00035101
             END-EVALUATE.                                              00035201
                                                                        00035301
                                                                        00035401
       2000-99-FIM.              EXIT.                                  00035501
                                                                        00035601
      *-------------------------------------------------------------*   00035701
       3000-FINALIZAR                           SECTION.                00035801
      *-------------------------------------------------------------*   00036000
                                                                        00037000
              DISPLAY ' -----FIM DO PROGRAMA----- '.                    00038000
                                                                        00039000
       3000-99-FIM.              EXIT.                                  00040000
      *-------------------------------------------------------------*   00041000
       9000-TRATAERROS                              SECTION.            00042000
      *-------------------------------------------------------------*   00043000
                                                                        00044000
       9000-99-FIM.              EXIT.                                  00045000
