      *=============================================================*   00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=============================================================*   00003000
                                                                        00004000
       PROGRAM-ID. FR19DB04.                                            00005001
                                                                        00006000
      *=============================================================*   00007000
      *   AUTOR....:RAFAEL VIANA                                    *   00007100
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00007200
      *   DATA ....:30/05/2022                                      *   00007300
      *-------------------------------------------------------------*   00007400
      *   OBJETIVO:                                                 *   00007500
      *       EXCLUI UM REGISTRO DA TABELA.                         *   00007600
      *                                                             *   00007700
      *                                                             *   00007800
      *-------------------------------------------------------------*   00007900
      *   BASE DE DADOS:                                            *   00008000
      *   TABELA.DB2..                                              *   00008100
      *    DDNAME              I/O                 INCLUDE/BOOK     *   00008200
      *   IVAN.FUNC             I                  #BKFUNC----      *   00008300
      *-------------------------------------------------------------*   00008400
      *   MODULOS....:                             INCLUDE/BOOK     *   00008500
      *=============================================================*   00008600
                                                                        00008700
      *=============================================================*   00008800
       ENVIRONMENT                               DIVISION.              00008900
      *=============================================================*   00009000
                                                                        00009100
      *=============================================================*   00009200
       CONFIGURATION                               SECTION.             00009300
      *=============================================================*   00009400
       SPECIAL-NAMES.                                                   00009500
           DECIMAL-POINT IS COMMA.                                      00009600
                                                                        00009700
      *=============================================================*   00009800
       DATA                                      DIVISION.              00009900
      *=============================================================*   00010000
      *=============================================================*   00020000
       WORKING-STORAGE                             SECTION.             00021000
      *=============================================================*   00021100
                                                                        00021200
           EXEC SQL                                                     00021300
              INCLUDE #BKFUNC                                           00021400
           END-EXEC.                                                    00021500
                                                                        00021600
           EXEC SQL                                                     00021700
              INCLUDE SQLCA                                             00021800
           END-EXEC.                                                    00021900
                                                                        00022000
       77 WRK-ID              PIC 9(05) VALUE ZEROES.                   00023000
       77 WRK-SQLCODE         PIC -999.                                 00024000
       77 WRK-NULL-EMAIL      PIC S9(4) COMP.                           00025000
                                                                        00026000
      *=============================================================*   00026100
       PROCEDURE DIVISION.                                              00026200
      *=============================================================*   00026300
                                                                        00026400
      *-------------------------------------------------------------*   00026500
       0000-PRINCIPAL                           SECTION.                00026600
      *-------------------------------------------------------------*   00026700
                                                                        00026800
            PERFORM  1000-INICIAR.                                      00026900
            PERFORM  2000-PROCESSAR.                                    00027000
            PERFORM  3000-FINALIZAR.                                    00027100
            STOP RUN.                                                   00027200
                                                                        00027300
                                                                        00027400
      *-------------------------------------------------------------*   00027500
       1000-INICIAR                             SECTION.                00027600
      *-------------------------------------------------------------*   00027700
                                                                        00027800
            ACCEPT WRK-ID FROM SYSIN.                                   00027900
                                                                        00028000
       1000-99-FIM.              EXIT.                                  00029000
      *-------------------------------------------------------------*   00030000
       2000-PROCESSAR                           SECTION.                00031000
      *-------------------------------------------------------------*   00031100
                                                                        00031200
            MOVE WRK-ID TO DB2-ID.                                      00031300
                                                                        00031400
            EXEC SQL                                                    00031500
              DELETE FROM IVAN.FUNC WHERE ID = :DB2-ID                  00031600
            END-EXEC.                                                   00032500
                                                                        00032600
            EVALUATE SQLCODE                                            00032700
             WHEN 0                                                     00032800
              DISPLAY 'REGISTRO DELETADO.' WRK-ID                       00032900
             WHEN 100                                                   00033900
              DISPLAY 'NAO ENCONTRADO ' DB2-ID                          00034000
             WHEN OTHER                                                 00034100
              MOVE SQLCODE TO WRK-SQLCODE                               00034200
               DISPLAY 'ERRO NA LEITURA ' WRK-SQLCODE                   00034300
            END-EVALUATE.                                               00034402
                                                                        00034500
                                                                        00034600
       2000-99-FIM.              EXIT.                                  00034700
                                                                        00034800
      *-------------------------------------------------------------*   00034900
       3000-FINALIZAR                           SECTION.                00035000
      *-------------------------------------------------------------*   00036000
                                                                        00037000
              DISPLAY ' -----FIM DO PROGRAMA----- '.                    00038000
                                                                        00039000
       3000-99-FIM.              EXIT.                                  00040000
      *-------------------------------------------------------------*   00041000
       9000-TRATAERROS                              SECTION.            00042000
      *-------------------------------------------------------------*   00043000
                                                                        00044000
       9000-99-FIM.              EXIT.                                  00045000
