      *=============================================================*   00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=============================================================*   00003000
                                                                        00004000
       PROGRAM-ID. FR19DB01.                                            00005000
                                                                        00006000
      *=============================================================*   00007000
      *   AUTOR....:RAFAEL VIANA                                    *   00007100
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00007200
      *   DATA ....:07/06/2022                                      *   00007308
      *-------------------------------------------------------------*   00007400
      *   OBJETIVO:                                                 *   00007500
      *       LEITURA DE UM REGISTRO DA TABELA.                     *   00007602
      *                                                             *   00007700
      *                                                             *   00007800
      *-------------------------------------------------------------*   00007900
      *   BASE DE DADOS:                                            *   00008007
      *   TABELA.DB2..                                              *   00008107
      *    DDNAME              I/O                 INCLUDE/BOOK     *   00008207
      *   IVAN.FUNC             I                  #BKFUNC----      *   00008307
      *-------------------------------------------------------------*   00008600
      *   MODULOS....:                             INCLUDE/BOOK     *   00008700
      *=============================================================*   00008900
                                                                        00009000
      *=============================================================*   00009100
       ENVIRONMENT                               DIVISION.              00009200
      *=============================================================*   00009300
                                                                        00009400
      *=============================================================*   00009500
       CONFIGURATION                               SECTION.             00009600
      *=============================================================*   00009700
       SPECIAL-NAMES.                                                   00009800
           DECIMAL-POINT IS COMMA.                                      00009900
                                                                        00010000
      *=============================================================*   00017000
       DATA                                      DIVISION.              00017100
      *=============================================================*   00017200
      *=============================================================*   00021600
       WORKING-STORAGE                             SECTION.             00021700
      *=============================================================*   00021800
                                                                        00021900
           EXEC SQL                                                     00022000
              INCLUDE #BKFUNC                                           00023000
           END-EXEC.                                                    00023100
                                                                        00023200
           EXEC SQL                                                     00023300
              INCLUDE SQLCA                                             00023400
           END-EXEC.                                                    00023500
                                                                        00023600
       77 WRK-ID              PIC 9(05) VALUE ZEROES.                   00023900
       77 WRK-SQLCODE         PIC -999.                                 00024000
       77 WRK-NULL-EMAIL      PIC S9(4) COMP.                           00025001
                                                                        00026100
      *=============================================================*   00026200
       PROCEDURE DIVISION.                                              00026300
      *=============================================================*   00026400
                                                                        00026500
      *-------------------------------------------------------------*   00026600
       0000-PRINCIPAL                           SECTION.                00026700
      *-------------------------------------------------------------*   00026800
                                                                        00026900
            PERFORM  1000-INICIAR.                                      00027000
            PERFORM  2000-PROCESSAR.                                    00027400
            PERFORM  3000-FINALIZAR.                                    00027600
            STOP RUN.                                                   00027800
                                                                        00027900
                                                                        00028000
      *-------------------------------------------------------------*   00028100
       1000-INICIAR                             SECTION.                00028200
      *-------------------------------------------------------------*   00028300
                                                                        00028800
            ACCEPT WRK-ID FROM SYSIN.                                   00028900
                                                                        00029000
       1000-99-FIM.              EXIT.                                  00029100
      *-------------------------------------------------------------*   00031300
       2000-PROCESSAR                           SECTION.                00031400
      *-------------------------------------------------------------*   00031500
                                                                        00031600
            MOVE WRK-ID TO DB2-ID.                                      00031700
                                                                        00031800
            EXEC SQL                                                    00031900
            SELECT ID,NOME,SETOR,SALARIO,DATAADM,EMAIL                  00032000
             INTO :DB2-ID,                                              00032100
                  :DB2-NOME,                                            00032200
                  :DB2-SETOR,                                           00032300
                  :DB2-SALARIO,                                         00032400
                  :DB2-DATAADM,                                         00032500
                  :DB2-EMAIL     :WRK-NULL-EMAIL                        00032600
             FROM IVAN.FUNC                                             00032700
              WHERE ID= :DB2-ID                                         00032800
            END-EXEC.                                                   00032900
                                                                        00033000
            EVALUATE SQLCODE                                            00033100
             WHEN 0                                                     00033200
              DISPLAY 'ID......' DB2-ID                                 00033303
              DISPLAY 'NOME....' DB2-NOME                               00033403
              DISPLAY 'SETOR...' DB2-SETOR                              00033503
              DISPLAY 'SALARIO.' DB2-SALARIO                            00033603
              DISPLAY 'DATAADM.' DB2-DATAADM                            00033703
               IF WRK-NULL-EMAIL = 0                                    00033903
                 DISPLAY 'EMAIL. ' DB2-EMAIL                            00034003
               ELSE                                                     00034103
                 DISPLAY 'EMAIL NULO'                                   00034203
               END-IF                                                   00034303
             WHEN 100                                                   00034403
              DISPLAY 'NAO ENCONTRADO ' DB2-ID                          00034503
             WHEN OTHER                                                 00034603
               MOVE SQLCODE TO WRK-SQLCODE                              00034703
               DISPLAY 'ERRO NA LEITURA ' WRK-SQLCODE                   00034803
             END-EVALUATE.                                              00034903
                                                                        00035003
                                                                        00036200
       2000-99-FIM.              EXIT.                                  00036300
                                                                        00036400
      *-------------------------------------------------------------*   00038900
       3000-FINALIZAR                           SECTION.                00039000
      *-------------------------------------------------------------*   00039100
                                                                        00039200
              DISPLAY ' -----FIM DO PROGRAMA----- '.                    00039800
                                                                        00039900
       3000-99-FIM.              EXIT.                                  00040000
      *-------------------------------------------------------------*   00045700
       9000-TRATAERROS                              SECTION.            00045800
      *-------------------------------------------------------------*   00045900
                                                                        00046300
       9000-99-FIM.              EXIT.                                  00047000
