      *====================================================             00010002
       IDENTIFICATION                           DIVISION.               00020002
      *====================================================             00030002
       PROGRAM-ID. FR01CB02.                                            00040000
                                                                        00041000
      *====================================================             00050002
      *  AUTOR: RAFAEL                                                  00060000
      * EMPRESA: FOURSYS                                                00061000
      *====================================================             00070002
                                                                        00080000
      *====================================================             00090002
       ENVIRONMENT                              DIVISION.               00100002
      *====================================================             00110002
                                                                        00120000
      *====================================================             00130002
       DATA                                     DIVISION.               00140002
      *====================================================             00150002
       WORKING-STORAGE                          SECTION.                00150104
       77 NOME    PICTURE  X(20) VALUE SPACES.                          00150206
       77 SALARIO PICTURE  9(05) VALUE ZEROES.                          00150306
                                                                        00151000
      *====================================================             00160002
       PROCEDURE                                DIVISION.               00170002
      *====================================================             00180002
                                                                        00180108
      *----------------------------------------------------             00180208
       0000-PRINCIPAL                           SECTION.                00180308
      *----------------------------------------------------             00180408
                                                                        00180508
           PERFORM 1000-INICIALIZAR.                                    00180608
           PERFORM 2000-PROCESSAR.                                      00180708
           PERFORM 3000-FINALIZAR.                                      00180808
           STOP RUN.                                                    00180908
                                                                        00181008
       0000-99-FIM.          EXIT.                                      00181108
                                                                        00181208
      *----------------------------------------------------             00181308
       1000-INICIALIZAR                         SECTION.                00181408
      *----------------------------------------------------             00181508
           ACCEPT NOME       FROM SYSIN.                                00181607
           ACCEPT SALARIO    FROM SYSIN.                                00182007
                                                                        00183008
       1000-99-FIM.          EXIT.                                      00185008
                                                                        00186008
      *----------------------------------------------------             00187008
       2000-PROCESSAR                           SECTION.                00188008
      *----------------------------------------------------             00189008
                                                                        00189108
           DISPLAY 'MEU NOME...'   NOME.                                00190007
           DISPLAY 'SALARIO...' SALARIO.                                00191004
                                                                        00191108
       2000-99-FIM.          EXIT.                                      00192008
                                                                        00193008
      *----------------------------------------------------             00193108
       3000-FINALIZAR                           SECTION.                00193208
      *----------------------------------------------------             00193308
                                                                        00194008
           DISPLAY ' FIM DO PROGRAMA '.                                 00195008
                                                                        00196008
       3000-99-FIM.          EXIT.                                      00197008
                                                                        00198008
                                                                        00199008
      *----------------------------------------------------             00199108
       9000-TRATA-ERROS                         SECTION.                00199208
      *----------------------------------------------------             00199308
                                                                        00200008
       9000-99-FIM.          EXIT.                                      00210008
