      *====================================================             00010000
       IDENTIFICATION                           DIVISION.               00020000
      *====================================================             00030000
       PROGRAM-ID. FR01CB03.                                            00040000
                                                                        00041000
      *====================================================             00042000
      *  AUTOR: RAFAEL                                                  00043000
      * EMPRESA: FOURSYS                                                00044000
      * OBJETIVO: RECEBENDO VARIAVEIS E EFETUANDO COMANDO               00044116
      *           DISPLAY.                                              00044216
      *====================================================             00045000
                                                                        00046000
      *====================================================             00047000
       ENVIRONMENT                              DIVISION.               00048000
      *====================================================             00049000
                                                                        00050000
      *====================================================             00060000
       DATA                                     DIVISION.               00070000
      *====================================================             00080000
       WORKING-STORAGE                          SECTION.                00090000
       01 WRK-DATA.                                                     00100004
         05 WRK-ANO        PIC 9(04) VALUE ZEROES.                      00110014
         05 WRK-MES        PIC 9(02) VALUE ZEROES.                      00130007
         05 WRK-DIA        PIC 9(02) VALUE ZEROES.                      00140014
      *====================================================             00150000
       PROCEDURE                                DIVISION.               00160000
      *====================================================             00170000
                                                                        00171016
      *----------------------------------------------------             00172016
       0000-PRINCIPAL                           SECTION.                00173016
      *----------------------------------------------------             00174016
                                                                        00175016
            PERFORM 1000-INICIALIZAR.                                   00176016
            PERFORM 2000-PROCESSARO.                                    00177016
            PERFORM 3000-FINALIZAR.                                     00178016
            STOP RUN.                                                   00179016
                                                                        00179116
       0000-99-FIM.        EXIT.                                        00179216
                                                                        00179316
      *----------------------------------------------------             00179416
       1000-INICIALIZAR                         SECTION.                00179516
      *----------------------------------------------------             00179616
                                                                        00179716
           ACCEPT WRK-DATA FROM DATE YYYYMMDD.                          00180013
                                                                        00180116
       1000-99-FIM.        EXIT.                                        00181016
                                                                        00181116
      *----------------------------------------------------             00181216
       2000-PROCESSAR                           SECTION.                00181316
      *----------------------------------------------------             00181416
                                                                        00181516
           DISPLAY 'SAOPAULO, ' WRK-DIA ' DO ' WRK-MES ' DE ' WRK-ANO.  00181615
                                                                        00181716
       2000-99-FIM.        EXIT.                                        00181816
                                                                        00181916
      *----------------------------------------------------             00182016
       3000-PROCESSAR                           SECTION.                00182116
      *----------------------------------------------------             00183016
                                                                        00183116
           DISPLAY ' FIM DO PROGRAMA '.                                 00184016
                                                                        00184116
       3000-99-FIM.        EXIT.                                        00185016
                                                                        00185116
      *----------------------------------------------------             00186016
       9000-TRATA-ERROS                         SECTION.                00187016
      *----------------------------------------------------             00188016
                                                                        00188116
       9000-99-FIM.        EXIT.                                        00189016
