      *====================================================             00010000
       IDENTIFICATION                           DIVISION.               00020000
      *====================================================             00030000
       PROGRAM-ID. FR01CB21.                                            00040000
                                                                        00041000
      *====================================================             00042000
      *  AUTOR: RAFAEL                                                  00043000
      * EMPRESA: FOURSYS                                                00044000
      *====================================================             00045000
      *                                                                 00045100
      * OBJETIVO: APLICANDO COMANDO EVALUETE PARA MEDIA.                00045209
      *            CALCULANDO MEDIA E MOSTRANDO NA TELA.                00045309
      *           SE O ALUNO FOI APROVADO OU REPROVADO.                 00045409
      *====================================================             00045500
                                                                        00045600
      *====================================================             00045700
       ENVIRONMENT                              DIVISION.               00045800
      *====================================================             00045900
       CONFIGURATION                            SECTION.                00046000
       SPECIAL-NAMES.                                                   00046100
           DECIMAL-POINT IS COMMA.                                      00046200
                                                                        00046300
      *====================================================             00046400
       DATA                                     DIVISION.               00046500
      *====================================================             00046600
       WORKING-STORAGE                          SECTION.                00046700
      *==============ENTRADA DE DADOS======================             00046800
                                                                        00046900
       01 WRK-DADOS.                                                    00047000
          05 WRK-NOTA1         PIC 9(02)V99 VALUE ZEROS.                00048000
          05 WRK-NOTA2         PIC 9(02)V99 VALUE ZEROS.                00049000
                                                                        00049200
      *-------------VARIAVEIS DE CALCULO------------------              00049300
       77 WRK-MEDIA            PIC 9(03)V99 VALUE ZEROS.                00049500
      *-------------VARIAVEIS=EDITADAS---------------------             00049600
                                                                        00049700
       77 WRK-NOTA1-ED         PIC Z9,99.                               00049800
       77 WRK-NOTA2-ED         PIC Z9,99.                               00049900
       77 WRK-MEDIA-ED         PIC ZZ9,99.                              00050000
                                                                        00050100
      *====================================================             00050200
       PROCEDURE                                DIVISION.               00050300
      *====================================================             00050400
                                                                        00050505
      *----------------------------------------------------             00050605
       0000-PRINCIPAL                           SECTION.                00050705
      *----------------------------------------------------             00050805
                                                                        00050905
            PERFORM 1000-INICIALIZAR.                                   00051007
            PERFORM 2000-PROCESSAR.                                     00051107
            PERFORM 3000-FINALIZAR.                                     00051207
            STOP RUN.                                                   00051307
                                                                        00051405
       0000-99-FINAL.            EXIT.                                  00051508
                                                                        00051608
      *----------------------------------------------------             00051705
       1000-INICIALIZAR                         SECTION.                00051805
      *----------------------------------------------------             00051905
                                                                        00052005
           ACCEPT WRK-DADOS      FROM SYSIN.                            00052100
                                                                        00052200
       1000-99-FINAL.            EXIT.                                  00052308
                                                                        00052408
      *----------------------------------------------------             00052505
       2000-PROCESSAR                           SECTION.                00052605
      *----------------------------------------------------             00052705
                                                                        00052804
           COMPUTE WRK-MEDIA = ( WRK-NOTA1 + WRK-NOTA2 ) / 2.           00052905
                                                                        00053000
      *--------------ADICIONANDO MASCARAS------------------             00053104
                                                                        00053204
             MOVE WRK-MEDIA TO WRK-MEDIA-ED.                            00053300
             MOVE WRK-NOTA1 TO WRK-NOTA1-ED.                            00053400
             MOVE WRK-NOTA2 TO WRK-NOTA2-ED.                            00053500
                                                                        00053600
      *--------------INFORMACOES VARIAVEIS-----------------             00053704
                                                                        00053804
              DISPLAY ' NOTA1......' WRK-NOTA1-ED.                      00053900
              DISPLAY ' NOTA2......' WRK-NOTA2-ED.                      00054000
              DISPLAY ' MEDIA......' WRK-MEDIA-ED.                      00054100
                                                                        00054204
      *----------------------------------------------------             00054304
                                                                        00054404
             EVALUATE WRK-MEDIA                                         00054500
               WHEN 0,00 THRU 2,00                                      00054600
                DISPLAY ' REPROVADO.. '                                 00054700
               WHEN 2,01 THRU 5,99                                      00054800
                DISPLAY ' RECUPERACAO '                                 00054900
               WHEN 6,00 THRU 8,99                                      00055000
                DISPLAY ' APROVADO....'                                 00055100
               WHEN 9,00 THRU 10,00                                     00055200
                DISPLAY ' APROVADO COM LOUVOR'                          00055300
               WHEN OTHER                                               00055400
                DISPLAY ' MEDIA ERRADA.......'                          00055500
             END-EVALUATE.                                              00056000
                                                                        00057000
       2000-99-FINAL.            EXIT.                                  00057108
                                                                        00057208
      *----------------------------------------------------             00058005
       3000-FINALIZAR                           SECTION.                00059005
      *----------------------------------------------------             00060005
            DISPLAY ' FINALIZAR PROGRAMA '.                             00070006
                                                                        00071008
       3000-99-FINAL.            EXIT.                                  00080008
