      *====================================================             00010000
       IDENTIFICATION                           DIVISION.               00020000
      *====================================================             00030000
       PROGRAM-ID. FR01CB10.                                            00040003
                                                                        00041000
      *====================================================             00042000
      *  AUTOR: RAFAEL                                                  00043000
      * EMPRESA: FOURSYS                                                00044000
      *====================================================             00045000
                                                                        00046000
      *====================================================             00047000
       ENVIRONMENT                              DIVISION.               00048000
      *====================================================             00049000
       CONFIGURATION                            SECTION.                00049104
       SPECIAL-NAMES.                                                   00049204
           DECIMAL-POINT IS COMMA.                                      00049304
                                                                        00050000
      *====================================================             00060000
       DATA                                     DIVISION.               00070000
      *====================================================             00080000
       WORKING-STORAGE                          SECTION.                00090000
       01 WRK-DADOS.                                                    00100000
          05 WRK-N1            PIC 9(02) VALUE ZEROS.                   00110000
          05 WRK-N2            PIC 9(02) VALUE ZEROS.                   00120000
          05 WRK-N3            PIC 9(02) VALUE ZEROS.                   00130000
       77 WRK-N4               PIC 9(03) VALUE ZEROS.                   00130100
       77 WRK-N4-ED            PIC ZZ9,99.                              00130204
      *====================================================             00131000
       PROCEDURE                                DIVISION.               00132000
      *====================================================             00133000
                                                                        00133106
                                                                        00133206
      *----------------------------------------------------             00133306
       0000-PRINCIPAL                           SECTION.                00133406
      *----------------------------------------------------             00133506
            PERFORM 1000-INICIALIZAR.                                   00133606
            PERFORM 2000-PROCESSAR.                                     00133706
            PERFORM 3000-FINALIZAR.                                     00133806
            STOP RUN.                                                   00133906
                                                                        00134006
       0000-99-FIM.            EXIT.                                    00134106
                                                                        00134206
      *----------------------------------------------------             00134306
       1000-INICIALIZAR                         SECTION.                00134406
      *----------------------------------------------------             00134506
                                                                        00134606
           ACCEPT   WRK-DADOS  FROM SYSIN.                              00134700
                                                                        00134806
       1000-99-FIM.            EXIT.                                    00134906
                                                                        00135006
      *----------------------------------------------------             00135106
       2000-PROCESSAR                           SECTION.                00135206
      *----------------------------------------------------             00135306
                                                                        00135406
           DISPLAY 'WRK-N1.......... ' WRK-N1.                          00135500
           DISPLAY 'WRK-N2...........' WRK-N2.                          00135600
           DISPLAY 'WRK-N3.......... ' WRK-N3.                          00135700
            ADD WRK-N1 WRK-N2 WRK-N3 TO WRK-N4.                         00135804
             MOVE WRK-N4 TO WRK-N4-ED.                                  00135904
           DISPLAY 'SOMANDO N1,N2,N3 ' WRK-N4-ED.                       00136005
            ADD 10 TO WRK-N4.                                           00136104
             MOVE WRK-N4 TO WRK-N4-ED.                                  00136204
           DISPLAY 'ADICIONANDO 10.. ' WRK-N4-ED.                       00136305
                                                                        00136406
       2000-99-FIM.            EXIT.                                    00136506
      *----------------------------------------------------             00136606
       3000-FINALIZAR                           SECTION.                00136706
      *----------------------------------------------------             00136806
                                                                        00136906
            DISPLAY ' FIM DO PROGRAMA '.                                00137006
                                                                        00137106
       3000-99-FIM.            EXIT.                                    00137206
                                                                        00137306
      *----------------------------------------------------             00137406
       9000-TRATA-ERROS                         SECTION.                00137506
      *----------------------------------------------------             00137606
                                                                        00137706
       3000-99-FIM.            EXIT.                                    00137806
