      *====================================================             00010000
       IDENTIFICATION                           DIVISION.               00020000
      *====================================================             00030000
       PROGRAM-ID. FR01CB14.                                            00040000
                                                                        00041000
      *====================================================             00042000
      *  AUTOR: RAFAEL                                                  00043000
      * EMPRESA: FOURSYS                                                00044000
      *====================================================             00045000
                                                                        00046000
      *====================================================             00047000
       ENVIRONMENT                              DIVISION.               00048000
      *====================================================             00049000
       CONFIGURATION                            SECTION.                00049106
       SPECIAL-NAMES.                                                   00049206
           DECIMAL-POINT IS COMMA.                                      00049306
                                                                        00050000
      *====================================================             00060000
       DATA                                     DIVISION.               00070000
      *====================================================             00080000
       WORKING-STORAGE                          SECTION.                00090000
       01 WRK-DADOS.                                                    00100000
          05 WRK-FUNC          PIC X(15)    VALUE SPACES.               00110000
          05 WRK-TOTVENDAS     PIC 9(05)V99 VALUE ZEROS.                00120000
          05 WRK-COMISSAO      PIC 9(02)V99 VALUE ZEROS.                00121000
       77 WRK-VLRCOM           PIC 9(06)V99 VALUE ZEROS.                00122006
       77 WRK-VLRCOM-ED        PIC ZZZ.ZZ9,99.                          00123007
      *====================================================             00124000
       PROCEDURE                                DIVISION.               00125000
      *====================================================             00126000
                                                                        00126109
      *----------------------------------------------------             00126209
       0000-PRINCIPAL                           SECTION.                00126309
      *----------------------------------------------------             00126409
                                                                        00126509
             PERFORM 1000-INICIALIZAR.                                  00126609
             PERFORM 2000-PROCESSAR.                                    00126709
             PERFORM 3000-FINALIZAR.                                    00126809
             STOP RUN.                                                  00126909
                                                                        00127011
       0000-99-FINAL.       EXIT.                                       00127111
                                                                        00127209
      *----------------------------------------------------             00127309
       1000-INICIALIZAR                         SECTION.                00127410
      *----------------------------------------------------             00127509
                                                                        00127609
           ACCEPT WRK-DADOS FROM SYSIN.                                 00127700
                                                                        00127811
       1000-99-FINAL.       EXIT.                                       00127911
                                                                        00128009
      *----------------------------------------------------             00128109
       2000-PROCESSAR                           SECTION.                00128209
      *----------------------------------------------------             00128309
                                                                        00128409
           DISPLAY 'WRK-FUNC...........' WRK-FUNC.                      00128500
           DISPLAY 'WRK-TOTVENDAS......' WRK-TOTVENDAS.                 00129000
           DISPLAY 'WRK-COMISSAO.......' WRK-COMISSAO.                  00130000
            MULTIPLY WRK-TOTVENDAS BY WRK-COMISSAO                      00130108
                                    GIVING WRK-VLRCOM.                  00130208
           DISPLAY 'WRK-VLRCOM.........' WRK-VLRCOM.                    00130303
            MOVE WRK-VLRCOM TO WRK-VLRCOM-ED                            00130406
           DISPLAY 'WRK-VLRCOM-ED.....' WRK-VLRCOM-ED.                  00130506
                                                                        00130611
                                                                        00130711
       2000-99-FINAL.       EXIT.                                       00130811
      *----------------------------------------------------             00130909
       3000-FINALIZAR                           SECTION.                00131009
      *----------------------------------------------------             00131109
                                                                        00131209
             DISPLAY ' FIM DO PROGRAMA '.                               00132009
                                                                        00133011
       3000-99-FINAL.       EXIT.                                       00134011
