      *====================================================             00010000
       IDENTIFICATION                           DIVISION.               00020000
      *====================================================             00030000
       PROGRAM-ID. FR01CB22.                                            00040001
                                                                        00041000
      *====================================================             00042000
      *  AUTOR: RAFAEL                                                  00043000
      * EMPRESA: FOURSYS                                                00044000
      *====================================================             00045000
      *                                                                 00045100
      * OBJETIVO: APLICANDO CONHECIMENTO DA VARIAVEL 88.                00045220
      *                                                                 00045300
      *====================================================             00045400
                                                                        00045500
      *====================================================             00045600
       ENVIRONMENT                              DIVISION.               00045700
      *====================================================             00045800
       CONFIGURATION                            SECTION.                00045900
       SPECIAL-NAMES.                                                   00046000
           DECIMAL-POINT IS COMMA.                                      00046100
                                                                        00046200
      *====================================================             00046300
       DATA                                     DIVISION.               00046400
      *====================================================             00046500
       WORKING-STORAGE                          SECTION.                00046600
      *==============ENTRADA DE DADOS======================             00046700
                                                                        00046800
       01 WRK-DADOS.                                                    00046900
           05 WRK-DATA          PIC X(08)    VALUE SPACES.              00047000
           05 WRK-VALOR         PIC 9(05)V99 VALUE ZEROS.               00048000
           05 WRK-LANCAMENTO    PIC X(30)    VALUE SPACES.              00049013
           05 WRK-TIPO          PIC X(01)    VALUE SPACES.              00049100
             88 WRK-TIPO-P                   VALUE 'C' 'D'.             00049209
      *====================================================             00049400
       PROCEDURE                                DIVISION.               00049500
      *====================================================             00049600
                                                                        00049715
      *----------------------------------------------------             00049815
       0000-PRINCIPAL                           SECTION.                00049915
      *----------------------------------------------------             00050015
                                                                        00050115
             PERFORM 1000-INICIALIZAR.                                  00050215
              IF WRK-DATA NOT EQUAL SPACES                              00050322
               PERFORM 2000-PROCESSAR                                   00050423
              END-IF.                                                   00050522
             PERFORM 3000-FINALIZAR.                                    00051015
             STOP RUN.                                                  00051215
                                                                        00051324
       0000-99-FIM.       EXIT.                                         00051421
                                                                        00051521
      *----------------------------------------------------             00051615
       1000-INICIALIZAR                        SECTION.                 00051715
      *----------------------------------------------------             00051815
                                                                        00051915
           ACCEPT WRK-DADOS     FROM SYSIN.                             00052015
                                                                        00052121
       1000-99-FIM.       EXIT.                                         00052221
                                                                        00052321
      *----------------------------------------------------             00052415
       2000-PROCESSAR                          SECTION.                 00052515
      *----------------------------------------------------             00052615
                                                                        00052715
             IF NOT WRK-TIPO-P                                          00052815
                 DISPLAY ' REGISTRO NAO VALIDO '                        00052919
             ELSE                                                       00053015
                 DISPLAY 'DATA ........' WRK-DATA                       00053115
                 DISPLAY 'VALOR........' WRK-VALOR                      00053215
                 DISPLAY 'LANCAMENTO...' WRK-LANCAMENTO                 00053315
              IF WRK-TIPO                                               00053415
                EQUAL 'C'                                               00053515
                   DISPLAY ' PAGAMENTO NO CREDITO '                     00053615
              ELSE                                                      00053715
                   DISPLAY ' PAGAMENTO DO DEBITO  '                     00053815
             END-IF.                                                    00053915
                                                                        00054021
       2000-99-FIM.       EXIT.                                         00054221
                                                                        00054321
      *----------------------------------------------------             00054415
       3000-FINALIZAR                          SECTION.                 00054515
      *----------------------------------------------------             00054615
                                                                        00054715
            DISPLAY '----------------FIM DO PROGRAMA '.                 00054818
                                                                        00054921
       3000-99-FIM.       EXIT.                                         00055021
                                                                        00056021
      *----------------------------------------------------             00057021
       9000-TRATAR-ERROS                       SECTION.                 00058021
                                                                        00059021
       9000-99-FIM.       EXIT.                                         00060021
