      *====================================================             00010000
       IDENTIFICATION                           DIVISION.               00020000
      *====================================================             00030000
       PROGRAM-ID. FR01CB03.                                            00040000
                                                                        00041000
      *====================================================             00042000
      *  AUTOR: RAFAEL                                                  00043000
      * EMPRESA: FOURSYS                                                00044000
      * OBJETIVO:PRIMEIRO PASSO COM FILLER.                             00044102
      *====================================================             00045000
                                                                        00046000
      *====================================================             00047000
       ENVIRONMENT                              DIVISION.               00048000
      *====================================================             00049000
                                                                        00050000
      *====================================================             00060000
       DATA                                     DIVISION.               00070000
      *====================================================             00080000
       WORKING-STORAGE                          SECTION.                00090000
       01 WRK-DADOS.                                                    00100000
          05 WRK-ID         PIC 9(05) VALUE ZEROES.                     00110000
          05 WRK-PRODUTO    PIC X(30) VALUE SPACES.                     00120000
          05 FILLER         PIC X(10) VALUE SPACES.                     00130001
          05 WRK-PRECO      PIC 9(06) VALUE ZEROES.                     00140000
      *====================================================             00160000
       PROCEDURE                                DIVISION.               00170000
      *====================================================             00180000
                                                                        00180102
      *----------------------------------------------------             00180202
       0000-PRINCIPAL                           SECTION.                00180302
      *----------------------------------------------------             00180402
                                                                        00180502
             PERFORM 1000-INICIALIZAR.                                  00182002
             PERFORM 2000-PROCESSAR.                                    00182102
             PERFORM 3000-FINALIZAR.                                    00182202
             STOP RUN.                                                  00182302
                                                                        00182402
       0000-99-FIM.           EXIT.                                     00182502
                                                                        00182602
      *----------------------------------------------------             00182702
       1000-INICIALIZAR                         SECTION.                00182802
      *----------------------------------------------------             00182902
                                                                        00183002
           ACCEPT  WRK-DADOS  FROM SYSIN.                               00183102
                                                                        00183202
       1000-99-FIM.           EXIT.                                     00183302
                                                                        00183402
      *----------------------------------------------------             00183502
       2000-PROCESSAR                           SECTION.                00183602
      *----------------------------------------------------             00183702
                                                                        00183802
           DISPLAY 'ID   .....'  WRK-ID.                                00183900
           DISPLAY 'PRODUTO...'  WRK-PRODUTO.                           00184000
           DISPLAY 'PRECO ....'  WRK-PRECO.                             00185000
                                                                        00187102
       2000-99-FIM.           EXIT.                                     00188002
                                                                        00188102
      *----------------------------------------------------             00189002
       3000-FINALIZAR                           SECTION.                00190002
      *----------------------------------------------------             00200002
                                                                        00201002
            DISPLAY ' FIM DO PROGRAMA '.                                00202002
                                                                        00203002
       3000-99-FIM.           EXIT.                                     00210002
                                                                        00211002
      *----------------------------------------------------             00220002
       9000-TRATA-ERROS                         SECTION.                00230002
      *----------------------------------------------------             00240002
                                                                        00241002
       3000-99-FIM.           EXIT.                                     00250002
