//IVANEXEC JOB 'EXE COB',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//STEP01   EXEC PGM=SORT
//SORTIN   DD   DSN=GR.FOUR019.BASE1807,DISP=SHR
//SORTOUT  DD   SYSOUT=*
//SYSOUT   DD   SYSOUT=*
//*-- SORT SIMPLES  1 CHAVE SORT FIELDS=(01,04,CH,A)
//*-- SORT COMPOSTO 2 CHAVE SORT FIELDS=(01,04,CH,A,10,20,CH,A)
//*-- SORT COMPOSTO 2 CHAVE SORT FIELDS=(01,04,A,10,20,A),FORMAT=CH
//*SORT FIELDS=(01,09,CH,A)
//SYSIN    DD  *
  SORT FIELDS=(01,04,CH,A)
//*  SUM  FIELDS=(34,08,ZD)
