//IVANEXEC JOB 'EXE COB',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//STEP01   EXEC PGM=SORT
//SORTIN   DD   *
12345JONAS               20220720
12345CARLA               20220721
//SORTOUT  DD   DSN=&TEMP,DISP=(,CATLG,DELETE),SPACE=(TRK,(1))
//SYSOUT   DD   SYSOUT=*
//SYSIN    DD  *
  INREC FIELDS=(01,25,30,04,28,02,26,02)
  SORT FIELDS=(01,04,CH,A)
   INCLUDE COND=(26,08,CH,EQ,DATE=(DMY-))
