//FOUR019X JOB 'ICE003',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,01)
//STEP01   EXEC PGM=ICETOOL
//****************
//*COMANDO COUNT FROM UTILIZANDO A SAIDA NO CARTAO TOOLMSG
//****************
//****************
//*USING CARD (ADC UMA CONDICAO DE PESQUISA) PARA CONTA
//****************
//TOOLMSG  DD  SYSOUT=*
//DFSMSG   DD  SYSOUT=*
//INPUT    DD  *
123
123
234
123
123
//TOOLIN   DD *
 COUNT FROM(INPUT) USING(CARD)
//CARDCNTL DD *
 INCLUDE COND=(1,3,CH,EQ,C'234')
