//FOUR019X JOB 'ICE002',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,01)
//STEP01   EXEC PGM=ICETOOL
//TOOLMSG  DD  SYSOUT=*
//DFSMSG   DD  SYSOUT=*
//INPUT    DD  DSN=GR.FOUR019.EVSA0407,DISP=SHR
//*OUTPUT   DD  DSN=GR.FOUR019.EVSA0407,DISP=SHR
//OUTPUT   DD  SYSOUT=*
//TOOLIN   DD *
 COPY FROM(INPUT) TO(OUTPUT)  VSAMTYPE(F)
