//FOUR019X JOB 'COMP COB',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,01) 00010000
//EXECUTAR EXEC PGM=FR19CB24                                            00020004
//STEPLIB  DD DSN=PR.FOUR019.OBJ,DISP=SHR                               00030000
//SYSIN    DD *                                                         00040000
001LAVA-LOUCA                    0450000001                             00050005
002MAQUINA-DE-LAVAR              0200000008                             00060005
999                                                                     00070003
