//FOUR019X JOB 'COMP COB',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,01) 00010099
//EXECUTAR EXEC PGM=FR19CB26                                            00140099
//STEPLIB  DD DSN=PR.FOUR019.OBJ,DISP=SHR                               00150014
//SYSIN    DD *                                                         00160009
276565986012000003                                                      00215099
