//FOUR019X JOB 'COMP COB',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,01) 00010000
//EXECUTAR EXEC PGM=FR19CB23                                            00020000
//STEPLIB  DD DSN=PR.FOUR019.OBJ,DISP=SHR                               00030000
//SYSIN    DD *                                                         00040000
A                                                                       00050002
