//FOUR019X JOB 'RAFAEL',CLASS=C,MSGCLASS=X,NOTIFY=FOUR019               00000100
//STEP01   EXEC PGM=IEFBR14                                             00000200
                                                                        00001000
